{"id":6161,"date":"2022-10-18T10:51:43","date_gmt":"2022-10-18T16:51:43","guid":{"rendered":"https:\/\/myrgroup.com\/?p=6161"},"modified":"2024-10-11T16:03:05","modified_gmt":"2024-10-11T22:03:05","slug":"when-extreme-weather-strikes-our-crews-help-get-power-restored","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/when-extreme-weather-strikes-our-crews-help-get-power-restored\/","title":{"rendered":"When Extreme Weather Strikes, Our Crews Help Get Power Restored"},"content":{"rendered":"\n<h2 class=\"wp-block-heading is-style-has-underline\"><strong>THROUGH HURRICANES, DERECHOS, ICE STORMS, AND FIRES OUR SUBSIDIARIES STAND READY TO ASSIST WITH EMERGENCY RESPONSE<\/strong><\/h2>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1280\" height=\"1600\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-1280x1600.jpg\" alt=\"An electrical construction crew at work after a hurricane.\" class=\"wp-image-6162\" style=\"width:320px;height:400px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-1280x1600.jpg 1280w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-819x1024.jpg 819w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-768x960.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-1229x1536.jpg 1229w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-1638x2048.jpg 1638w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/SECO-Ian-Response-Edited-IMG_0157-scaled.jpg 2048w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" \/><figcaption class=\"wp-element-caption\">Sturgeon Electric crews working to restore power after Hurricane Ian.<\/figcaption><\/figure><\/div>\n\n\n<p class=\"has-drop-cap\">Peak Atlantic hurricane season is here, and although the season began quietly, that all changed in recent weeks as Hurricane Fiona hit Puerto Rico and <a href=\"https:\/\/www.axios.com\/2022\/09\/28\/florida-hurricanes-intensity-categories-ian-charley-michael\">Hurricane Ian<\/a> became the strongest hurricane to make landfall in Florida since Michael in 2018.<\/p>\n\n\n\n<p>A Category 4 hurricane, Ian roared to shore near Fort Myers, Fla. with 150 mph winds on Sept. 28, and ravaged the state. By nightfall, <a href=\"https:\/\/www.nbcnews.com\/news\/us-news\/live-blog\/hurricane-ian-live-updates-rcna49729\">more than 2 million<\/a> residents had lost power, according to NBC.<\/p>\n\n\n\n<p>More than 160 workers from four MYR Group subsidiaries were dispatched to Florida and the Carolinas to assist with restoring power to communities.<\/p>\n\n\n\n<p>Ahead of the storm’s landfall, The L.E. Myers Co. (L.E. Myers) sent crews from the Marshalltown, Iowa district – staging them in Florida starting on Sept. 26. Crews from L.E. Myers’ Indianapolis District, Harlan Electric Company’s Rochester Hills, Mich. District and Great Southwestern Construction were there the following day.<\/p>\n\n\n\n<p>Sturgeon Electric also dispatched crews from Kansas to assist in North Carolina beginning Sept. 29.<\/p>\n\n\n\n<p>Hazel and Doug Witter of Ormond Beach were among the millions of Floridians who lost power. Hazel sent a note of thanks to L.E. Myers through Facebook for restoring their power sooner than they had expected.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>“We appreciate them coming to Florida … leaving their families, to come here to restore our power &#8230; Thank you so much! It doesn’t feel like that’s enough, but it’s from our hearts.”<\/p><cite>Hazel and Doug Witter of Ormond Beach, Florida<\/cite><\/blockquote><\/figure>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-medium is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"768\" height=\"1024\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Hurricane-Ian_HEC_2-768x1024.jpg\" alt=\"Harlan Electric trucks ready and waiting to assist in power restoration in Florida.\" class=\"wp-image-6166\" style=\"width:274px;height:366px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Hurricane-Ian_HEC_2-768x1024.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Hurricane-Ian_HEC_2-1200x1600.jpg 1200w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Hurricane-Ian_HEC_2-1152x1536.jpg 1152w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Hurricane-Ian_HEC_2.jpg 1512w\" sizes=\"(max-width: 768px) 100vw, 768px\" \/><figcaption class=\"wp-element-caption\">Harlan Electric ready to help with power restoration after Ian.<\/figcaption><\/figure><\/div>\n\n\n<p>Hurricanes and other severe weather can wreak havoc on transmission and distribution power lines, substations, and towers, cutting people off from the power they need to survive. When these disasters strike, utilities often need extra crews to deploy for emergency response, and often request it through the mutual assistance network or directly from other utilities.<\/p>\n\n\n\n<p>MYR Group subsidiaries from <a href=\"https:\/\/www.alaskasnewssource.com\/2022\/01\/04\/power-slowly-coming-back-mat-su-residents-after-wind-storm\/\">Alaska<\/a> to New England have experience responding to all manner of extreme weather emergencies. As different seasonal weather threats strike, our subsidiaries specializing in transmission and distribution work stand prepped and ready to offer emergency response and restoration services to our customers and their communities.<\/p>\n\n\n\n<p>Our emergency crews have rebuilt hundreds of miles of power lines ranging from 4kV to 765kV, following storm damage. <\/p>\n\n\n\n<p>“Each emergency comes with unique challenges that must be recognized and addressed, but it is rewarding work,” said Michael Mumm, a regional vice president with L.E. Myers. “A lot of the workers within the trade really want to be involved when electric service needs to be restored to a devastated area. One of the rewards of this effort is when communities extend their appreciation and thanks toward the hard work that is being exercised when you’re out there.”<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Our Subsidiaries Responded to Critical Electric Needs Following 2021 Hurricanes<\/strong><\/h3>\n\n\n\n<p>June through November marks the official Atlantic hurricane season, with the heaviest activity typically in August, September and October. As of the first week of October, there have been 10 named storms including four hurricanes (winds 74 mph or higher). Regardless of the forecasts, utilities remain prepared in case of emergencies like Hurricane Ian and reach out when disasters strike.<\/p>\n\n\n\n<p>Mumm explained that, as contractors, we collaborate with our utility customers who will explain the need and offer to release a certain number of crews.&nbsp;Then district level management and field leadership will evaluate their workload, project schedules and business needs and determine how many crews to release to support restoration efforts. Often, crews are deployed from many states and MYR Group locations across the US.<\/p>\n\n\n\n<p>Last year, three MYR Group subsidiaries worked to get power back on during a devastating hurricane season that hit Louisiana particularly hard. Hurricane Ida slammed into the gulf state on Aug. 29, 2021, with 150 mph winds. Tied for the strongest hurricane to ever make landfall in Louisiana, Ida knocked out power for <a href=\"https:\/\/www.washingtonpost.com\/weather\/2021\/09\/03\/hurricane-ida-numbers-surge-wind-pressure-damage\/\">1.5 million<\/a> people, according <em>to The Washington Post<\/em>. In addition to damaging substations and distribution lines, Ida toppled transmission lattice towers. Hurricane Nicholas pounded the region again just weeks later.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1512\" height=\"1134\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/03\/Hurricane-Ida-15.jpg\" alt=\"Two lineman work from lifted bucket trucks on power line poles along a heavily wooded highway\" class=\"wp-image-4498\" style=\"width:459px;height:344px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/03\/Hurricane-Ida-15.jpg 1512w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/03\/Hurricane-Ida-15-1024x768.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/03\/Hurricane-Ida-15-768x576.jpg 768w\" sizes=\"(max-width: 1512px) 100vw, 1512px\" \/><figcaption class=\"wp-element-caption\">MYR Group subsidiaries restoring power after Hurricane Ida in 2021.<\/figcaption><\/figure><\/div>\n\n\n<p>L.E. Myers, Great Southwestern Construction and Sturgeon Electric all <a href=\"https:\/\/myrgroup.com\/projects\/hurricanes-ida-and-nicholas\/\">mobilized<\/a> crews to assist with clean up, restore power and repair damaged electrical structures, including monopoles and lattice towers in the devastated northwestern Gulf Coast.<\/p>\n\n\n\n<p>Robert Harris, operations manager, and Mike Strong, construction manager, deployed with Great Southwestern Construction crews to Mandeville and Hammond, La. to repair damaged distribution lines. The team worked 16-hour days, seven days a week cleaning up and restoring power to residents and businesses.<\/p>\n\n\n\n<p>According to Harris and Strong, each storm brings different challenges and unique safety hazards that can include unique wildlife threats. To stay safe, all crew members test lines for voltage and grounding before touching or beginning any work. During this particular response, crews also had to watch out for debris, snakes, alligators, and poison ivy since many of the power lines run through wooded areas.<\/p>\n\n\n\n<p>Lance Stadler, a Sturgeon Electric superintendent, worked with roughly 30 people to repair backbone mainlines and distribution lines north of New Orleans that had sustained damage from high winds.<\/p>\n\n\n\n<p>The community appreciated all the crews’ dedication and speed. One resident of Hammond, La. wrote to L.E. Myers to thank them for their hard work.<\/p>\n\n\n\n<p>“With all of the destruction, my fellow neighbors and I figured it would be several weeks before we would somewhat be able to get back to a normal life in our town. However, because of the dedication of your men and the many other people that came to Louisiana to help, we were back up with power way sooner than we thought,” the letter read.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Harlan Electric Helps Restore Power in Massachusetts After ‘Bomb Cyclone’<\/strong><\/h3>\n\n\n\n<p>Hurricanes are just one of the extreme weather threats to power lines. MYR Group subsidiaries have provided emergency restoration support following <a href=\"https:\/\/myrgroup.com\/projects\/iowa-derecho-storm-work\/\">wind<\/a> storms, ice and snowstorms, as well as <a href=\"https:\/\/myrgroup.com\/news\/from-bobcat-to-marshall-sturgeon-electric-restores-lines-after-wildfires\/\">fires<\/a>.<\/p>\n\n\n\n<p>Crews from Harlan Electric’s Rochester Hills location were rapidly dispatched to the Plymouth and Cape Cod, Mass. area to restore power to residents after a “<a href=\"https:\/\/www.cnn.com\/2021\/10\/27\/weather\/bomb-cyclone-noreaster-power-outage\/index.html\">bomb cyclone”<\/a> nor’easter left hundreds of thousands of New Englanders without power in last fall. The team spent about five days in the area working 17 to 18 hours a day patrolling lines — finding downed wires, trees on lines, uprooted poles and damaged crossbars — and resolving those problems so the lines could be reenergized. The long hours also require tremendous focus and crews must be prepared for another challenge: equipment and the way things are built can differ from utility to utility.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Sturgeon Electric Called Upon When Windstorm Strikes Southcentral Alaska<\/strong><\/h3>\n\n\n\n<p>In the depths of winter, weather-related power outages can become dangerous, especially in states like Alaska.<\/p>\n\n\n\n<p>Last winter, a <a href=\"https:\/\/www.alaskasnewssource.com\/2022\/01\/04\/power-slowly-coming-back-mat-su-residents-after-wind-storm\/\">three-day windstorm<\/a> took out power for thousands in southcentral Alaska. The local utility deployed its own crews and asked several contractors for help restoring power, including Sturgeon Electric, according to KTUU.<\/p>\n\n\n\n<p>Eight Sturgeon Electric crews worked to repair downed wire, replace broken poles and crossarms, and install new conductor Sturgeon Electric dispatched additional crews to restore service to customers of two other nearby electrical associations affected by the same windstorm.<\/p>\n\n\n\n\n\n\n\n<p><strong>When disaster strikes your transmission and distribution systems, our companies are here to help you get power back on for your customers quickly. <\/strong><\/p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/myrgroup.com\/capabilities\/emergency-restoration\/\">Learn more about our emergency restoration services<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>THROUGH HURRICANES, DERECHOS, ICE STORMS, AND FIRES OUR SUBSIDIARIES STAND READY TO ASSIST WITH EMERGENCY RESPONSE Peak Atlantic hurricane season is here, and although the season began quietly, that all changed in recent weeks as Hurricane Fiona hit Puerto Rico and Hurricane Ian became the strongest hurricane to make landfall in Florida since Michael in [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":6166,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[90,91,92],"class_list":["post-6161","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-all-news-stories","category-our-company","category-projects"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/6161"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=6161"}],"version-history":[{"count":6,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/6161\/revisions"}],"predecessor-version":[{"id":9394,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/6161\/revisions\/9394"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/6166"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=6161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=6161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}