{"id":8520,"date":"2024-04-03T11:48:47","date_gmt":"2024-04-03T17:48:47","guid":{"rendered":"https:\/\/myrgroup.com\/?p=8520"},"modified":"2024-10-11T15:15:15","modified_gmt":"2024-10-11T21:15:15","slug":"from-a-single-crew-to-more-than-500-people-serving-the-customer-great-southwestern-construction-has-become-valued-oncor-partner","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/from-a-single-crew-to-more-than-500-people-serving-the-customer-great-southwestern-construction-has-become-valued-oncor-partner\/","title":{"rendered":"From a Single Crew to More Than 500 People Serving the Customer, Great Southwestern Construction Has Become Valued Oncor Partner"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\"><strong>Latest 345kV Line Restoration Is a Testament to the Trusted Partnership<\/strong><\/h2>\n\n\n\n<p>Great Southwestern Construction, Inc. (Great Southwestern) began working for Oncor in 2014 with a single substation crew. Since then, the relationship has grown steadily and Great Southwestern, an MYR Group subsidiary, has become a trusted and valued partner for this Texas electric utility.<\/p>\n\n\n\n<p>Today, between 500 and 600 Great Southwestern employees support the utility’s electrical substation, distribution, and energized and deenergized transmission needs. But that didn’t happen overnight.<\/p>\n\n\n\n<p>At the beginning, Great Southwestern engaged with Oncor’s leadership to gain a deep understanding of the company’s multi-faceted needs. Those years of relationship building, and dedication to providing responsiveness, transparency and communication, and quality work as an alliance partner year after year cemented trust.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>&#8220;Our relationship with Oncor is built on trust and transparency.&#8221;<\/p><cite>Great Southwestern Construction Regional Manager Ryan Little<\/cite><\/blockquote><\/figure>\n\n\n\n<p>Great Southwestern President Brandon Lark described the relationship as a true partnership where they work to understand each other’s needs. “We openly discuss with one another any challenges, needs and constraints,” Lark said. That openness allows both groups to see project aspects through the same lens and ensures we are jointly focused on achieving project success.<\/p>\n\n\n\n<p>Most of the Great Southwestern crews that support Oncor operate within their Dallas\/Fort Worth service area. This ensures there are enough local resources to provide construction services for the utility’s planned construction projects and emergency response needs. Great Southwestern also has access to a large and extensive national fleet through its parent company MYR Group. This is more cost effective, because it eliminates unnecessary equipment costs. One of the fleet facilities is based in Alvarado, Texas, enabling fast and efficient equipment deployment to projects in the region.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>When a Severe Storm Took Down Part of Major Transmission Line, Oncor Called on Great Southwestern<\/strong><\/h3>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Severe Storm | Lattice Towers Destroyed | Restoration Work | Great Southwestern Construction | Oncor\" width=\"1778\" height=\"1000\" src=\"https:\/\/www.youtube.com\/embed\/Lfl1wG305q4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<p>Oncor knows it can rely on Great Southwestern, especially for storm damage and emergency outages. All it takes is a phone call.<\/p>\n\n\n\n<p>When a severe storm damaged a 12-mile stretch of 345kV Oncor transmission line near Buffalo, Texas in June 2023, Oncor did just that. They immediately called Great Southwestern for support assessing damage and restoring the critical line in the middle of summer load season.<\/p>\n\n\n\n<p>The line damage included fallen and mangled transmission towers, which had been ripped off their foundations, some of which fell on I-45 – one of the busiest interstates in Texas. The first thing Great Southwestern crews needed to do was test and ground the lines and secure the towers left standing at each end of the damage, to allow for safe cleanup of downed towers and wires.<\/p>\n\n\n\n<p>Superior logistical planning to determine the necessary labor and equipment was needed to develop an accelerated project schedule – which Great Southwestern was able to complete even faster. They managed to execute the entire restoration within seven weeks.<\/p>\n\n\n\n<p><strong>“<\/strong>We had a lot of crew members who were local, but we also brought some people in from a few hours away – which is relatively local in this business. I think having a collection of people that were pretty close to the project, especially with the number of consecutive days the project team was working on the restoration, was instrumental in helping them get the project done quickly,” said Regional Vice President Mark Hammons.<\/p>\n\n\n\n<p>Great Southwestern also utilized the MYR Group Fleet department’s equipment and tooling resources to mobilize quickly and ensure mechanics were on site for maintenance and other needs during the restoration project.<\/p>\n\n\n\n<p>Texas summer heat was in full effect, so extra measures were taken to keep everyone working safely in the triple digit temperatures. Some work was performed at night to help manage the heat and maintain productivity. Oncor also brought a nurse on site and others to help with logistics and hydration. Shaded break areas were established too. These efforts helped prevent injuries and equipment damage during the project.<\/p>\n\n\n\n<p>“When they have something this intense happen, they know all they have to do is pick up the phone and call Great Southwestern, call MYR Group, and that we will respond in any way necessary to provide the assistance they need. This [project] was a true picture of our professional relationship with Oncor,” Regional Manager Ryan Little said.<\/p>\n\n\n\n\n\n\n\n<p><strong>Related Project: <\/strong><a href=\"https:\/\/myrgroup.com\/projects\/oncor-electric-master-services-agreement-msa\/\">Oncor Electric Master Services Agreement (MSA)<\/a><\/p>\n\n\n\n\n\n\n\n<p><strong>All it takes is a phone call to get our companies’ assistance when a storm strikes your power infrastructure. Visit our emergency restoration page to learn more.<\/strong><\/p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/myrgroup.com\/capabilities\/emergency-restoration\/\">Learn More About emergency restoration<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Latest 345kV Line Restoration Is a Testament to the Trusted Partnership Great Southwestern Construction, Inc. (Great Southwestern) began working for Oncor in 2014 with a single substation crew. Since then, the relationship has grown steadily and Great Southwestern, an MYR Group subsidiary, has become a trusted and valued partner for this Texas electric utility. Today, [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":8519,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[90,91,92],"class_list":["post-8520","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-all-news-stories","category-our-company","category-projects","subsidiary-great-southwestern"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8520"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=8520"}],"version-history":[{"count":4,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8520\/revisions"}],"predecessor-version":[{"id":9378,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8520\/revisions\/9378"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/8519"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=8520"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=8520"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}