{"id":8900,"date":"2024-06-27T11:01:35","date_gmt":"2024-06-27T17:01:35","guid":{"rendered":"https:\/\/myrgroup.com\/?p=8900"},"modified":"2024-08-20T09:40:54","modified_gmt":"2024-08-20T15:40:54","slug":"labor-collaboration-is-expanding-opportunity-to-detroiters-looking-to-join-electrical-trade","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/labor-collaboration-is-expanding-opportunity-to-detroiters-looking-to-join-electrical-trade\/","title":{"rendered":"Labor Collaboration is Expanding Opportunity to Detroiters Looking to Join Electrical Trade"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\"><strong>Pre-apprentices gain the knowledge, skills, and certifications necessary to apply for IBEW-NECA apprenticeships<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Detroit Public Lighting Authority PLANT Program | Harlan Electric\" width=\"1778\" height=\"1000\" src=\"https:\/\/www.youtube.com\/embed\/yga_Si5qwKE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<p>There’s something special going on in the Motor City. Organizations in the electrical construction industry in Detroit have formed a unique relationship, and are working together to expand employment opportunities to local Detroiters amid an industry navigating labor constraints.<\/p>\n\n\n\n<p>Together, the Public Lighting Authority of Detroit (PLA), IBEW Local 17, MYR Group subsidiary Harlan Electric Company (Harlan Electric), and Universal Contracting Services found a way to increase exposure to Detroit locals who may not be aware of opportunities in the electrical trade and promote a more inclusive workforce. By collaboratively developing a new pre-apprenticeship program, they found a way to do just that. All parties benefit, but no one more so than the individuals joining the PLA’s program, which is called the Public Lighting Authority Nurturing Talent Program, or PLANT.<\/p>\n\n\n\n<p>Marcos Juarez is a PLANT pre-apprentice who wants to become a journeyman lineworker and considers the program a great opportunity to grow. He said, “What really excites me [about the program] is being able to become somebody more in life.”<\/p>\n\n\n\n<p>“You get to learn a lot about working under the foreman,” PLANT pre-apprentice Willie James Mann, Jr. said. “They prepare you for what is yet to come, so when you do get into the apprenticeship, you’ll already be ready.” Following his pre-apprenticeship, Mann was accepted into an electrical apprenticeship program.<\/p>\n\n\n\n<p>What they have built in Detroit is a program they hope will inspire other cities and companies to take and use as a model for their own efforts to be more inclusive and to provide career opportunities to those who may not have otherwise had knowledge about the trade.<\/p>\n\n\n\n<p>“We can only have about 10 or 12 individuals in our program [at one time], but what we have done, I believe, is created a roadmap for others to follow in different industries and even in similar industries to be able to address the issue of lack of minorities within the skilled trades,” said PLA’s Director of Government and Community Relations De’Andre Brooks.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>AN INDUSTRY IN NEED OF LABOR AND DIVERSITY<\/strong><\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"925\" src=\"https:\/\/www.harlanelectric.com\/wp-content\/uploads\/2024\/06\/De39Andre-Brooks_Detroit-Public-Lighting-Authority-1600x925.jpg\" alt=\"\" class=\"wp-image-8896\" style=\"width:452px;height:261px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/De39Andre-Brooks_Detroit-Public-Lighting-Authority-1600x925.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/De39Andre-Brooks_Detroit-Public-Lighting-Authority-1024x592.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/De39Andre-Brooks_Detroit-Public-Lighting-Authority-768x444.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/De39Andre-Brooks_Detroit-Public-Lighting-Authority-1536x888.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/De39Andre-Brooks_Detroit-Public-Lighting-Authority-2048x1184.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><figcaption class=\"wp-element-caption\">De’Andre Brooks, PLA Director of Government and Community Relations<\/figcaption><\/figure><\/div>\n\n\n<p>Less than 25 percent of electric transmission and distribution workers are minorities, according to a&nbsp;<a href=\"https:\/\/cewd.org\/wp-content\/uploads\/2023\/01\/CEWD-2023-Workforce-Report-Executive-Summary_2023-FINAL-1.pdf\">2023 survey<\/a>&nbsp;conducted for the Center for Energy Workforce Development.<\/p>\n\n\n\n<p>PLA leadership was concerned by the deficit of minorities in this, and other skilled trades and they were also inspired by Detroit mayors who challenged construction companies working in the city to hire more Detroiters. That motivated them to consider what they could do to provide opportunity to more individuals from their community.<\/p>\n\n\n\n<p>But as they started to think about how to get more Detroiters and minorities working on their property, Brooks said they realized many city residents “didn’t have the exposure, they didn’t have the qualifications” to get into skilled trade apprenticeships.<\/p>\n\n\n\n<p>Societal and educational changes have left many individuals, including Detroiters, unaware of skilled trade career opportunities like electrical line work, much less how to qualify for those jobs.<\/p>\n\n\n\n<p>“There’s a lot of inner-city people who don’t know about this trade. So, for them to have access and to see the opportunities, I think it’s very important,” Harlan General Foreman Rudy Bartlett said. Bartlett began his own lineworker career in Detroit and has spent many years training apprentices on their way to becoming journeymen lineworkers.<\/p>\n\n\n\n<p>Lack of knowledge was the first hurdle. Another was apprenticeship requirements. Many IBEW-NECA electrical apprenticeship programs require, or at least favor applicants who possess a commercial driver’s license (CDL). The rationale is sound – contractors who train apprentices on the job often have very little work that can be done on job site by a new apprentice if the apprentice cannot drive the equipment. However, obtaining a CDL can cost thousands of dollars and can take 2-3 weeks of schooling. Not everyone who wants to join the trade can afford to do it on their own.<\/p>\n\n\n\n<p>Brooks said the PLA also realized that the process to get into an apprenticeship isn’t always easy to navigate. That’s why, in collaboration with IBEW Local 17, they set out to build a pre-apprenticeship program that would equip participants with the experience and skills needed to apply for acceptance into the regional outside line apprenticeship organization, ALBAT, part of the NECA-IBEW Joint Apprenticeship Training Centers.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>SUCCESSFULLY FLIPPING THE APPRENTICESHIP SCRIPT<\/strong><\/h3>\n\n\n\n<p>Mike Kozlowski of Local 17 explained that the PLA wanted to flip the script of the apprenticeship process: “Essentially, before [PLANT] – it was get the tools, then come to us. And now it’s, come to us and we’ll help you get the tools.”<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1236\" height=\"1600\" src=\"https:\/\/www.harlanelectric.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-1236x1600.jpg\" alt=\"\" class=\"wp-image-8897\" style=\"width:425px;height:549px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-1236x1600.jpg 1236w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-791x1024.jpg 791w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-768x994.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-1187x1536.jpg 1187w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-1582x2048.jpg 1582w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-17-of-19-scaled.jpg 1978w\" sizes=\"(max-width: 1236px) 100vw, 1236px\" \/><figcaption class=\"wp-element-caption\">PLANT Pre-apprentice Brian Birton (left) helps perform a streetlight replacement on a Harlan Electric crew.<\/figcaption><\/figure><\/div>\n\n\n<p>For that to work, they realized it would require more collaborators.<\/p>\n\n\n\n<p>The PLA contracts out all its streetlight construction and maintenance work, so it incorporated the intention to start the pre-apprenticeship program into their requests for proposal (RFPs), and two contractors – Harlan Electric’s Rochester Hills district and Universal Contracting Services of Detroit – enthusiastically jumped on board.<\/p>\n\n\n\n<p>“I can’t even tell you, when we got the RFP, how personally excited I was,” Harlan Electric District Manager Adam Segers said, his passion for the program evident. “It’s probably the best part of my job to give back to the trade and help people in their career.”<\/p>\n\n\n\n<p>With Local 17, the PLA and contractors on board, the PLANT pre-apprenticeship program was born.<\/p>\n\n\n\n<p>Kevin Bryant, one of the principal partners of Universal Contracting Services, said joining the program aligned with their company principles.<\/p>\n\n\n\n<p>“We believe in giving opportunities to individuals in the place that we work in, so we thought it was a great program to take people who may have no idea what the utility field is about, introduce it to them and bring them into the program,” Bryant said.<\/p>\n\n\n\n<p>As the first contractor involved, Harlan Electric shared industry knowledge and found resources (like CDL grants through the MichiganWorks! Association) to improve the program for everyone.<\/p>\n\n\n\n<p>“The collaboration is the key,” said Brooks. “If we weren’t all working together this wouldn’t be possible. This is the model that should be taken across the country into other utilities and other industries. This is the model that can work, but it’s communication, cooperation, collaboration between all stakeholders to make it work.”<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>PLANT PRE-APPRENTICES LEARN, EARN, AND GAIN ESSENTIAL CERTIFICATIONS<\/strong><\/h3>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1280\" height=\"1600\" src=\"https:\/\/www.harlanelectric.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-1280x1600.jpg\" alt=\"\" class=\"wp-image-8899\" style=\"width:379px;height:473px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-1280x1600.jpg 1280w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-819x1024.jpg 819w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-768x960.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-1229x1536.jpg 1229w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-1639x2048.jpg 1639w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Roosevelt-Park_PLANT-Pre-Apprentice-Program_HEC_05-2023-3-of-7-scaled.jpg 2048w\" sizes=\"(max-width: 1280px) 100vw, 1280px\" \/><figcaption class=\"wp-element-caption\">PLANT pre-apprentice Gordon Wilson<\/figcaption><\/figure><\/div>\n\n\n<p>PLANT pre-apprentices work on Harlan Electric and Universal Contracting Services streetlight crews, where the contractors help them get the training they’ll need to apply for apprenticeships, as well as exposure to overhead and underground streetlight work by working alongside journeymen linemen. That training includes OSHA 10, CPR\/First Aid and a CDL.<\/p>\n\n\n\n<p>“They start out with a shovel in their hands digging holes. They learn the materials, the wires, the nicknames for materials,” Bartlett explained. They learn to use tools properly, drive and inspect equipment and ultimately gain exposure to everything about streetlight work. “The only thing they cannot do is go up in a bucket and perform work.”<\/p>\n\n\n\n<p>Bartlett shared that one of the PLANT pre-apprentices obtained his CDL during his first seven weeks in the program and was driving the truck and trailer to job sites every day to gain experience.<\/p>\n\n\n\n<p>If storms occur, they may get the opportunity to go out with a crew and identify hazards such as downed wires and potentially electrified fences.<\/p>\n\n\n\n<p>After learning what the job entails and being in the program for about a year, pre-apprentices apply for ALBAT line or substation apprenticeships with the guidance and support of the contractors they’ve worked for.<\/p>\n\n\n\n<p>“[We] coach them through the whole process, from applying to interviewing, to letter of recommendation,” said Segers.<\/p>\n\n\n\n<p>Those who become full-fledged apprentices may get moved on to other contractors to learn other work types, but Segers always keeps in touch with them. He considers them all a part of the Harlan family even once they’re wearing a different hard hat.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>CHANGING LIVES, ONE PRE-APPRENTICE AT A TIME<\/strong><\/h3>\n\n\n\n<p>Just over three years into the program, PLANT has seen 10 of its pre-apprentices move into the apprenticeships and one is waiting to get in. The program also has six new pre-apprentices who have been in the program for less than six months. As they move into apprenticeships, Brooks will find a new group of pre-apprentices to get them started.<\/p>\n\n\n\n<p>But those numbers fail to reflect the significance of the unique collaboration and the way it is changing participants’ lives.<\/p>\n\n\n\n<p>“I was already searching for something. I just needed something to do, I didn’t know what I wanted to do with my life career-wise,” PLANT pre-apprentice Brian Birton said.<\/p>\n\n\n\n<p>Before a friend talked him into joining PLANT he was job hopping. Now he says he’s “found a home.” He later applied and became an apprentice in the lineworker program. He works for Harlan Electric as a first-step apprentice, but even as a pre-apprentice he had become a kind of evangelist for the trade. “When I’m just out and about, I see young kids and I try to encourage them,” he said. “This industry could change your life, and your family’s.”<\/p>\n\n\n\n<p>Native Detroiter Gordon Wilson is also a part of PLANT. With a year in the program under his belt, he said he’s “Looking to start an apprenticeship I never had an opportunity to get into before.” He feels prepared thanks to the hands-on training he received in the program.<\/p>\n\n\n\n<p>Brooks is thrilled with the way the program is changing lives and providing opportunities.<\/p>\n\n\n\n<p>“I’m really excited about the people we’ve had go through so far, and I’m excited about the people coming up in the future,” he said. “Just because I believe that we’re learning and making the program better as we go along. And two years in, you kind of learn what works, what doesn’t work. And you tweak a little bit in terms of what you think could be or should be done differently.”<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"1067\" src=\"https:\/\/www.harlanelectric.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-12-of-19-1600x1067.jpg\" alt=\"\" class=\"wp-image-8898\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-12-of-19-1600x1067.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-12-of-19-1024x683.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-12-of-19-768x512.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-12-of-19-1536x1024.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/PLANT-Pre-Apprentice-Program_HEC_05-2023-12-of-19-2048x1365.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>There’s something special going on in the Motor City. Organizations in the electrical construction industry in Detroit, Michigan have formed a unique relationship, and are working together to expand employment opportunities to local Detroiters amid an industry navigating labor constraints.<\/p>\n","protected":false},"author":7,"featured_media":8895,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[90,92,1],"class_list":["post-8900","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-all-news-stories","category-projects","category-general","subsidiary-harlan-electric"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8900"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=8900"}],"version-history":[{"count":3,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8900\/revisions"}],"predecessor-version":[{"id":9211,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8900\/revisions\/9211"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/8895"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=8900"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=8900"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}