{"id":2111,"date":"2021-11-01T14:35:24","date_gmt":"2021-11-01T21:35:24","guid":{"rendered":"https:\/\/myrgroup.com\/?page_id=2111"},"modified":"2022-02-28T08:40:51","modified_gmt":"2022-02-28T16:40:51","slug":"environmental-policy","status":"publish","type":"page","link":"https:\/\/myrgroup.com\/environmental-policy\/","title":{"rendered":"Environmental Policy"},"content":{"rendered":"\n<div class=\"wp-block-group is-style-block-section-narrow\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div style=\"height:170px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n\n\n\n\n<h2 class=\"has-black-color has-text-color wp-block-heading\">ENVIRONMENTAL POLICY<\/h2>\n\n\n\n<p class=\"has-lead-font-size\"><strong>Introduction<\/strong><\/p>\n\n\n\n<p>We continually look to promote positive environmental stewardship and to preserve environmental resources on every project performed. It is the policy of MYR Group Inc. and its subsidiaries (collectively, “we” or the “Companies”) to comply with all applicable environmental laws and regulations and to conduct operations in a manner which will control and minimize potential environmental, health and safety risks to employees and the community. The Companies will cooperate with appropriate governmental agencies and authorities to develop and maintain standards and programs to ensure environmentally safe work places and to enhance the quality of our environment.<\/p>\n\n\n\n<p class=\"has-lead-font-size\"><strong>Scope<\/strong><\/p>\n\n\n\n<p>This Policy applies to all of our employees as well as those with whom we conduct business including our suppliers, subcontractors, agents, vendors, partners and other third parties (collectively, our “Partners”).<\/p>\n\n\n\n<p class=\"has-lead-font-size\"><strong>Reducing Environmental Impacts on Projects<\/strong><\/p>\n\n\n\n<p>From early project planning through post-construction, the Companies together with appropriate client representatives, contractors, subcontractors, governmental agencies and authorities, will work to develop and maintain environmental standards and programs that meet applicable project requirements and ensure environmentally safe work places and jobsites.<\/p>\n\n\n\n<p>Environmental considerations vary for each of our projects and can include environmentally-sensitive areas such as wetlands, rivers, streams and sandy areas as well as High Conservation Value habitats with high biological, ecological, social or cultural value such as tribal lands and sites with archaeological and historical significance.<\/p>\n\n\n\n<p>Environmental considerations and mitigation plans typically include:<\/p>\n\n\n\n<ul class=\"wp-block-list\"><li>assessing the project terrain, routes and access roads to determine necessary mitigation methods to preserve and protect the surrounding environment;<\/li><li>utilizing mats and low pressure equipment and identifying access points along project routes to avoid rutting and unnecessary impacts incurred by equipment and vehicles; and<\/li><li>subcontracting the use of heavy-lift helicopters where land access is not a viable method of site entry due to sensitive environmental constraints.<\/li><\/ul>\n\n\n\n<p>The Companies will consider restoration prescriptions that are appropriate for the region and the site conditions to be encountered.<\/p>\n\n\n\n<p><strong>Hazardous Materials Management<\/strong><\/p>\n\n\n\n<p>The release of hazardous substances can significantly impact the health and vitality of the surrounding environment and pose serious health and safety risks to individuals who live and work in these environments. The Companies will comply with all hazardous materials laws and regulations on projects, as well as procedural and reporting requirements related to hazardous materials management.<\/p>\n\n\n\n<p>Employees with potential for exposure to hazardous materials undergo applicable hazardous waste operations and emergency response (“HAZWOPER”) training, which covers the physical and health hazards associated with chemicals that might be present on a project or jobsite, measures for guarding against personal injury and environmental damage while dealing with hazardous substances, communication and emergency protocols, prospering labeling procedures, overview of safety data sheets (“SDS”), development of environmental and health programs, risk minimization practices and proper procedures for hazardous waste operations. Additional training is also provided for respiratory protection, the use of hazardous material personal protective equipment (“PPE”) and for exposure to asbestos and lead.<\/p>\n\n\n\n<p><em>Transportation and Removal of Hazardous Wast<\/em>e<\/p>\n\n\n\n<p>Employees responsible for the transportation and removal of hazardous waste undergo applicable hazardous materials training when hazardous waste or materials are introduced onto projects which require removal or transport. This training covers the nature of hazardous materials as well as the proper procedures to follow when transporting hazardous waste and what to do in the event of an emergency.<\/p>\n\n\n\n<p><em>Disposal of Hazardous and Non-Hazardous<\/em> Waste<\/p>\n\n\n\n<p>The Companies will perform duties in a manner that minimizes the generation of waste materials whenever possible and will monitor the storage, handling, use and disposal of waste materials. We will survey operations and identify measures to reduce the generation of wastes, especially those that are hazardous to our environment. Whenever possible, our project teams will work with recycling companies to remove certain materials from jobsites to help reduce the amount of waste.<\/p>\n\n\n\n<p><em>Spill Prevention Control and Countermeasure<\/em><\/p>\n\n\n\n<p>Spills of chemicals, oils and fuels could have significant negative impacts on the surrounding environment including the soil, water, air, biodiversity and human health. The Companies will comply with the requirements related to the development and\/or adherence to project or site-specific spill prevention control and countermeasure plans. These plans typically include procedures to follow for proper spill prevention, required employee training, oversight personnel, procedures for proper, timely and safe clean-up of spills, contingency plans for catastrophic spills, emergency response plans and proper internal and external notification, documentation and reporting requirements.<\/p>\n\n\n\n<p><strong>Storm Water Pollution Prevention Plans<\/strong><\/p>\n\n\n\n<p>The Companies will comply with requirements related to the development and\/or adherence to storm water pollution prevention plans (“SWPPP”) which include practices for reducing pollutants from storm water discharges from project sites and compliance assurance with terms and conditions of storm water permits.<\/p>\n\n\n\n<p><strong>Dust Control<\/strong><\/p>\n\n\n\n<p>The Companies will perform their respective work in a manner that minimizes the impact of dust in the environment. We will comply with requirements related to dust generating sources and dust control plans, and participate in the implementation of compliance measures required prior to, during and after dust generating activity on a project including the appropriate employee training for dust control.<\/p>\n\n\n\n<p><strong>Project Stakeholder Relations<\/strong><\/p>\n\n\n\n<p>We consider ourselves an extension of our client when interfacing with the communities in which we live and work. From project beginning through completion, we strive to maintain strong working relationships with stakeholders including the landowners, states, counties and municipalities on issues associated with access, right-of-ways and restoration.<\/p>\n\n\n\n<p><strong>Responsible Sourcing of Materials<\/strong><\/p>\n\n\n\n<p>We are committed to responsible sourcing of materials used in our services. We expect our Partners to take steps to determine if their products contain conflict minerals. If our Partners’ products include these conflict minerals, our Partners must notify us immediately. In such event, we expect our Partners to implement a supply chain due diligence process similar to the framework established by the Organisation for Economic Cooperation and Development (“OECD”) to identify the sources of these conflict minerals.<\/p>\n\n\n\n<p><strong>Reporting, Documentation and Recordkeeping<\/strong><\/p>\n\n\n\n<p>We will comply with our clients’ project-specific requirements and applicable laws and regulations on maintaining proper documentation and records related to a project’s environmental program, including orientation and training on proper reporting and record keeping procedures.<\/p>\n\n\n\n<p class=\"has-lead-font-size\"><strong>Climate Change<\/strong><\/p>\n\n\n\n<p>Climate change may create physical and financial risk. Physical risks from climate change could, among other things, include an increase in extreme weather events (such as floods or hurricanes), rising sea levels and limitations on water availability and quality. Such extreme weather conditions may limit the availability of resources and affect our operations. We consider these impacts of climate change when we develop our strategies to be well-positioned to adapt our business to meet these arising challenges.<\/p>\n\n\n\n<p class=\"has-lead-font-size\"><strong>Energy Conservation, Waste Management and Recycling<\/strong><\/p>\n\n\n\n<p><strong>In Our Offices<\/strong><br>Several of our offices have recycling programs for paper, plastic, aluminum and glass. We also have a recycling program for empty laser, toner and inkjet cartridges, as well as small electronics waste.<\/p>\n\n\n\n<p>Additional measures that our offices have implemented include LED lighting, occupancy sensors, efficient paper consumption measures (double-sided printing, printing materials only when necessary, eliminating use of Styrofoam and other disposable kitchen paper and plastic products), efficient energy consumption measures (limiting use of electronics and lights) and utilizing remote methods of collaboration to reduce the impacts caused by business travel.<\/p>\n\n\n\n<p><strong>On Projects<\/strong><br>We will implement programs to salvage and reuse excess materials, such as copper, aluminum and wood. We have also promoted our employees to donate scrap material to educational programs focused on the electrical trades.<\/p>\n\n\n\n<p><strong>Efficient Use of Water<\/strong><br>We acknowledge that water is a scarce resource globally and in certain regions in which we operate. We understand that access to water is a fundamental human right and we maintain responsibilities to reduce our impact on the water supply.<\/p>\n<\/div><\/div>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\"><\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>ENVIRONMENTAL POLICY Introduction We continually look to promote positive environmental stewardship and to preserve environmental resources on every project performed. It is the policy of MYR Group Inc. and its subsidiaries (collectively, “we” or the “Companies”) to comply with all applicable environmental laws and regulations and to conduct operations in a manner which will control [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-2111","page","type-page","status-publish","hentry"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages\/2111"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=2111"}],"version-history":[{"count":3,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages\/2111\/revisions"}],"predecessor-version":[{"id":2510,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages\/2111\/revisions\/2510"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=2111"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}