{"id":3,"date":"2021-06-14T20:23:11","date_gmt":"2021-06-14T20:23:11","guid":{"rendered":"https:\/\/myrgroup.com\/?page_id=3"},"modified":"2021-10-22T14:57:57","modified_gmt":"2021-10-22T21:57:57","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/myrgroup.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<div class=\"wp-block-group is-style-block-section-narrow\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div style=\"height:170px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n\n\n\n\n<h2 class=\"has-black-color has-text-color wp-block-heading\">PRIVACY POLICY<\/h2>\n\n\n\n<p>At MYR Group (referred to as “MYR Group,” “us” or “we”), we recognize that your privacy is important. This Policy discloses the privacy practices for MYR Group’s family of Websites (collectively, the “Website”), This Policy also covers how personal and other information that we receive or collect about you is treated. Please read the information below to learn the following regarding your use of this Website.<\/p>\n\n\n\n<p>You acknowledge that this <strong><em><u>Privacy Policy<\/u><\/em><\/strong> is designed to be read in connection with the Website Terms and Conditions of Use, which is available at <a href=\"https:\/\/myrgroup.com\/terms-conditions\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/myrgroup.com\/terms-conditions<\/a> and that by accessing or using our Website, you agree to be bound by the Website’s terms and conditions, as well as this Policy.<\/p>\n\n\n\n<p>We reserve the right to change this <strong><em><u>Privacy Policy<\/u><\/em><\/strong> from time to time. We will notify you about significant changes by updating any privacy information on this page. Your continued use of the Website and or Services available through this Website after such modifications will constitute your: (a) acknowledgment of the modified Policy; and (b) your agreement to abide and be bound by that Policy.<\/p>\n\n\n\n<p>IMPORTANT: BY USING THE WEBSITE AND\/OR OFFERINGS AVAILABLE ON THIS WEBSITE, YOU GIVE YOUR CONSENT THAT ALL PERSONAL DATA THAT YOU SUBMIT MAY BE PROCESSED BY US IN THE MANNER AND FOR THE PURPOSES DESCRIBED BELOW. IF YOU DO NOT AGREE TO THESE TERMS AND CONDITIONS, DO NOT USE THE WEBSITE.<\/p>\n\n\n\n<p><strong>1. Types of Information We Collect<\/strong><\/p>\n\n\n\n<p>On the Website, we may collect two types of information about our users: Personally Identifiable Information (“PII”) and Aggregate Information.<\/p>\n\n\n\n<p><strong>Personally Identifiable Information:<\/strong> This refers to information that lets us know the specifics of who you are. When you engage in certain activities on this Website, such as registering to receive information about MYR Group, we may ask you to provide certain information about yourself.<\/p>\n\n\n\n<p>Examples of PII may include your first and last name, email address, mailing address (including zip code), employer, job title and department, telephone and facsimile numbers, and other identifying information.<\/p>\n\n\n\n<p><strong>Aggregate Information:<\/strong> This refers to information that does not by itself identify a specific individual. We gather certain information about you based upon where you visit on our Website and what other sites may have directed you to us. This information, which is collected in a variety of different ways, is compiled, and analyzed on both a personal and an aggregated basis. This information may include the <strong><em><u>Website<\/u><\/em><\/strong>’s Uniform Resource Locator (“URL”) that points to the site you just came from, which URL you go to after visiting our Website, what browser you are using, and your Internet Protocol (“IP”) address.<\/p>\n\n\n\n<p><strong>2. How We Collect and Use Information<\/strong><\/p>\n\n\n\n<p>We do not collect any PII about you unless you voluntarily provide it to us. However, you may be required to provide certain PII to us when you elect to use certain services available on the Website. These may include (but is not limited to) sending us an email message or submitting a form or transmitting other information.<\/p>\n\n\n\n<p>We may use PII to deliver information to you and to contact you regarding administrative notices. Finally, we may use your PII to resolve disputes, troubleshoot problems and enforce our agreements with you, including our Website Terms of Use, and this <strong><em><u>Privacy Policy<\/u><\/em><\/strong>.<\/p>\n\n\n\n<p>We may also collect certain Aggregate Information. For example, we may use your IP address to diagnose problems with our servers, software, to administer our Website and to gather demographic information.<\/p>\n\n\n\n<p><strong>3. Cookies<\/strong><\/p>\n\n\n\n<p>Depending on how you use our Website, we may store cookies on your computer to collect certain aggregate data about our users and to customize certain aspects of your specific user experience. A cookie is a small data text file which is stored on your computer that uniquely identifies your browser. Cookies may also include more personalized information, such as your IP address, browser type, the server your computer is logged onto, the area code and zip code associated with your server, and your first name to welcome you back to our Site. We may use cookies to perform tasks such as: monitoring aggregate site usage metrics, storing and remembering your passwords (if you allow us to do so), storing account and advertising preferences that you have set, and personalizing the Services we make available to you. However, we do not use cookies to track your browsing behaviors.<\/p>\n\n\n\n<p>Most browsers are initially set up to accept cookies, but you can reset your browser to refuse all cookies or to indicate when a cookie is being sent. However, some aspects of the Website may not function properly if you elect to disable cookies.<\/p>\n\n\n\n<p><strong>4. Release of Information<\/strong><\/p>\n\n\n\n<p>We will not sell, trade, or rent your PII to others. We may provide some of our website services through contractual arrangements made with affiliates, service providers, partners and other third parties (“Service Partners”).<\/p>\n\n\n\n<p>The use of your PII by our Service Partners is governed by the respective privacy policies of those providers and is not subject to our control. Except as otherwise discussed in this <strong><em><u>Privacy Policy<\/u><\/em><\/strong>, this document only addresses the use and disclosure of information we collect from you. Other sites accessible through this Website have their own privacy policies and data collection, use and disclosure practices. Please consult each site’s <strong><em><u>privacy policy<\/u><\/em><\/strong>. We are not responsible for the policies or practices of third parties.<\/p>\n\n\n\n<p>Occasionally we may be required by law enforcement or judicial authorities to provide PII to the appropriate governmental authorities. In such cases, we will disclose PII upon receipt of a court order, subpoena, or to cooperate with a law enforcement investigation. We fully cooperate with law enforcement agencies in identifying those who use our services for illegal activities. We reserve the right to report to law enforcement agencies any activities that we in good faith believe to be unlawful.<\/p>\n\n\n\n<p>We may also provide Aggregate Information about our customers’ sales, traffic patterns, and related Website information to third party advertisers, but these statistics do not include any Personally Identifiable Information.<\/p>\n\n\n\n<p><strong>5. User Choices on Collection and Use of Information<\/strong><\/p>\n\n\n\n<p>If you indicated upon registration that you are interested in receiving information from us and our partners, we may send you email about the information you requested. Only Company (or agents working on behalf of Company and under confidentiality agreements) will send you these solicitations, and only if you have previously indicated that you wish to receive them. If you do not want to receive solicitations from us, you can “opt-out” by accessing your account online editing your account information to no longer receive such offers and mailings.<\/p>\n\n\n\n<p>You also have choices with respect to cookies, as described above. By modifying your browser preferences, you have the choice to accept all cookies, to be notified when a cookie is set, or to reject all cookies. If you choose to reject all cookies some parts of our Website may not work properly in your case.<\/p>\n\n\n\n<p><strong>6. Security of Your PII<\/strong><\/p>\n\n\n\n<p>At our Website you can be assured that your PII is secure, consistent with current industry standards. We strive to take appropriate security measures to protect against unauthorized access to or unauthorized alteration, disclosure, or destruction of your PII.<\/p>\n\n\n\n<p>Unfortunately, no data transmission over the Internet or any wireless network can be guaranteed to be 100% secure. As a result, while we strive to protect your PII, you acknowledge that: (a) there are security and privacy limitations inherent to the Internet which are beyond our control; and (b) the security, integrity, and privacy of all information and data exchanged between you and us through this Website cannot be guaranteed.<\/p>\n\n\n\n<p><strong>7. Miscellaneous<\/strong><\/p>\n\n\n\n<p>You must be at least 18 years old to have our permission to use this Site. Our policy is that we do not knowingly collect, use, or disclose PII about minor visitors.<\/p>\n\n\n\n<p>You should also be aware that when Personally Identifiable Information is voluntarily disclosed (i.e., your name, email address, etc.) in the public areas on this Website, that information, along with any information disclosed in your communication, can be collected, and used by third parties and may result in unsolicited messages (including unwanted spam messages) from third parties. Such activities are beyond our control and this Policy does not apply to such information.<\/p>\n<\/div><\/div>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div class=\"wp-block-group is-style-block-section footer-call-to-action\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div class=\"wp-block-columns has-myrgroup-blue-background-color has-background is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-vertically-aligned-center is-layout-flow wp-block-column-is-layout-flow\" style=\"flex-basis:66.66%\">\n<h2 class=\"has-white-color has-text-color wp-block-heading\">Strength in Diversity – Explore Our Vendor Program<\/h2>\n<\/div>\n\n\n\n<div class=\"wp-block-column is-vertically-aligned-center is-layout-flow wp-block-column-is-layout-flow\" style=\"flex-basis:33.33%\">\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link\" href=\"#\">LEARN MORE<\/a><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div><\/div>\n<\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>PRIVACY POLICY At MYR Group (referred to as “MYR Group,” “us” or “we”), we recognize that your privacy is important. This Policy discloses the privacy practices for MYR Group’s family of Websites (collectively, the “Website”), This Policy also covers how personal and other information that we receive or collect about you is treated. Please read [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-3","page","type-page","status-publish","hentry"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":12,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"predecessor-version":[{"id":1892,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/pages\/3\/revisions\/1892"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}