{"id":1875,"date":"2021-10-22T14:21:44","date_gmt":"2021-10-22T21:21:44","guid":{"rendered":"https:\/\/exiinc.com\/?page_id=1875"},"modified":"2023-03-15T11:02:38","modified_gmt":"2023-03-15T17:02:38","slug":"terms-conditions","status":"publish","type":"page","link":"https:\/\/exiinc.com\/terms-conditions\/","title":{"rendered":"Terms &#038; Conditions"},"content":{"rendered":"\n\n\n\n\n<div class=\"wp-block-group is-style-block-section-narrow\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div style=\"height:100px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"has-black-color has-text-color wp-block-heading\">Website Terms and Conditions of Use<\/h2>\n\n\n\n<p>These Terms and Conditions of Use (“Agreement”) are a legal agreement between the owner, MYR Group Inc. (“MYR Group”) and the user (“you” or “your”) of the MYR Group website <a href=\"http:\/\/www.MYRGroup.com\">www.exiinc.com<\/a> (“Website”). Please read this Agreement carefully before accessing or using the Website. By accessing the Website, you agree to be bound by this Agreement. If you do not accept all the terms and conditions set forth in this Agreement, then you may not use the Website.<\/p>\n\n\n\n<p>THESE TERMS INCLUDE AN ARBITRATION CLAUSE AND A WAIVER OF YOUR RIGHT TO PARTICIPATE IN A CLASS ACTION OR REPRESENTATIVE LAWSUIT.<\/p>\n\n\n\n<p>MYR Group may modify this Agreement at any time, for any reason, by posting a new version on the Website. These changes will not affect rights and obligations that arose prior to such change. Your continued use of the Website following the posting of the modified Agreement will be subject to the Agreement in effect at the time of your use. Please review this Agreement periodically for changes. If you object to any provision of this Agreement or any subsequent modification of this Agreement or become dissatisfied with the Website in any way, your only recourse is to immediately terminate your use of the Website.<\/p>\n\n\n\n<ol class=\"wp-block-list\" type=\"1\">\n<li>Limitations of Liability and Indemnification<strong>.<\/strong> By using any part of the Website, you agree that in no event will the Website, MYR Group, its officers, employees, agents, subsidiaries, or web hosting services be liable for any direct or indirect, incidental, special or consequential damages as a result of your accessing the Website and using any of the services available or advertised therein. Your sole remedy for any breach or default of this Agreement by the Website or MYR Group shall be to immediately terminate your use of the Website. You indemnify and agree to defend and hold harmless the Website, MYR Group, its officers, employees, agents, subsidiaries, and web hosting services and third parties for any losses, costs, liabilities and expenses (including but not limited to court costs, legal fees, awards or settlements) relating to or arising out of your use of the Website including any breach by you of the terms contained in this Agreement.<\/li>\n\n\n\n<li>Responsibility for Use of Website<strong>.<\/strong> You understand and agree that you are solely responsible for your actions and decisions to meet other people who you meet online by virtue of the Website. You understand that the Website and MYR Group do not perform psychological testing or background checks on the individuals who may use the Website. You understand and agree that you must take all reasonable precautions before meeting others through the Website, which includes, but is not limited to, exchanging e-mail first before giving out any personal information and meeting in a public place.<\/li>\n\n\n\n<li>Do Not Rely on the Website Opinions, advice, statements, or other comments found on the Website should not necessarily be relied upon and are not to be construed as professional advice from the Website or MYR Group. The Website and MYR Group do not guarantee the accuracy or completeness of any of the information provided therein and are not responsible for any loss resulting from your reliance on such information.<\/li>\n\n\n\n<li>Warning re: Offensive Information. It is possible that by using your e-mail address on the Website, other people may, through other means outside the control of the Website, have access to personal information about you. The Website, MYR Group its employees, agents, subsidiaries and web hosting services are not responsible for any offensive transmissions via email by others or for the release of any information by others about you.<\/li>\n\n\n\n<li>Right to Monitor. The Website and MYR Group reserve the right, but are not obligated, to monitor materials posted in any public area and shall have the right to remove any information deemed offensive by MYR Group staff. Notwithstanding the foregoing, you remain solely responsible for your use of any information contained on the site.<\/li>\n\n\n\n<li>Confidentiality. It is agreed that neither the Website nor MYR Group have an obligation to keep personal information confidential including, but not limited to, the following: (1) basic biographical information; (2) when you actively chose to post your personal information for others to see; (3) when you send a message to another client, which will disclose your e-mail address to that client or (4) you have harassed another person via any service provided by the Website, in which case the confidentiality clause contained in this Agreement is rendered null and void.<\/li>\n\n\n\n<li>Ownership, Copyrights, Trademarks, Licenses. The Website and MYR Group own and retain all proprietary rights to the Website, its content, its trademarks and copyrights. Except for any information that is in the public domain, you are not authorized to reproduce, transmit or distribute the proprietary information on the Website or of MYR Group. By posting or providing information to the Website and MYR Group you represent that you have the right to grant permission for use by the Website and MYR Group.<\/li>\n\n\n\n<li>No Warranties. The Website and MYR Group provide the Website, its content, and any related services on an &#8220;as is&#8221; basis and do not make any warranty (express, implied, limited or otherwise) in relation to the Website. Specifically, the Website and MYR Group do not warrant that any services indicated on the Website will be available, be uninterrupted, be error free, meet your requirements, or that any defects in the services or the Website will be corrected.<\/li>\n\n\n\n<li>Jurisdiction. You agree that by accepting this Agreement, you and MYR Group are each waiving the right to trial by jury and the ability to participate in a class action. ANY AND ALL DISPUTES MYR GROUP OR YOU HAVE RELATING IN ANY WAY TO THE WEBSITE, TO ANY SERVICES OFFERED ON THE WEBSITE, OR YOUR RELATIONSHIP WITH MYR GROUP (INCLUDING – WITHOUT LIMITATION – WITH RESPECT TO DATA, YOUR INTERACTION WITH MYR GROUP, MYR GROUP ADVERTISMENTS AND DISCLOSURES, EMAIL AND MOBILE SMS (TEXT) MESSAGES MYR GROUP SENDS YOU, OR THE USE OR DISCLOSURE OF ANY INFORMATION ABOUT YOU), THIS AGREEMENT WILL BE SUBMITTED TO CONFIDENTIAL ARBITRATION IN THE FEDERAL JUDICIAL DISTRICT IN WHICH YOU RESIDE, EXCEPT TO THE EXTEHT THAT YOU HAVE, IN ANY WAY, VIOLATED OR THREATENED TO VILOLATE ANY MYR GROUP COMPANY INTELLECTUAL PROPERTY RIGHT. CLAIMS INLCUDE CLAIMS BASED ON CONTRACT, TORT (INCLUDING INTENTIONAL TORT), FRAUD, AGENCY, YOUR OR MYR GROUP’S NEGLIGENCE, STATUTORY OR REGULATORY PROVISONS, OR ANY OTHER SOURCE OF LAW.                                                                                                 If you intend to seek arbitration, you must first send to MYR Group, by certified mail, a written notice of dispute (“Notice”). The Notice shall describe the nature and basis of the claim or disputes and the specific relief sought. If you and MYR Group cannot reach an agreement to resolve the claim within thirty (30) days after the notice is received, either pay may commence arbitration. All arbitrations required by this Agreement will be conducted under the Commercial Arbitration Rules of the American Arbitration Association. The arbitrator’s award is binding and must be entered in the courts of the State of Colorado. Unless you and MYR Group agree otherwise in writing, the arbitrator may not consolidate more than on person’s claims and may not otherwise preside over any form of a representative, private attorney general or class proceeding.<\/li>\n<\/ol>\n\n\n\n<p>If you intend to seek arbitration, you must first send to MYR Group, by certified mail, a written notice of dispute (“Notice”). The Notice shall describe the nature and basis of the claim or disputes and the specific relief sought. If you and MYR Group cannot reach an agreement to resolve the claim within thirty (30) days after the notice is received, either pay may commence arbitration. All arbitrations required by this Agreement will be conducted under the Commercial Arbitration Rules of the American Arbitration Association. The arbitrator’s award is binding and must be entered in the courts of the State of Colorado. Unless you and MYR Group agree otherwise in writing, the arbitrator may not consolidate more than on person’s claims and may not otherwise preside over any form of a representative, private attorney general or class proceeding.<\/p>\n\n\n\n<p>TO THE EXTENT PERMITTED BY LAW, YOU WILL NOT AGREE TO ACT AS A REPRESENTATIVE OR A PRIVATE ATTORNEY GENERAL, OR IN ANY OTHER REPRESENTATIVE CAPACITY, OR PARTICIPATE AS A MEMBER OF A CLASS OF CLAIMANTS IN ANY LAWSUIT AGAINST COMPANY IN ANY COURT, OR IN ARBITRATION, WITH RESEPECT TO ANY CLAIMS. THIS SECTION (JURISDICTION) WILL SURVIVE THE TERMINATION OF THE RELATIONSHIP BETWEEN YOU AND MYR GROUP FOR ANY AND ALL DISPUTES YOUR OR THE COMPANY HAS RELATING – IN ANY WAY- TO THE WEBSITE OR YOUR RELATIONSHIP WITH THE COMPANY<\/p>\n\n\n\n<p>10. Severability. If any provision is found to be invalid, the remaining provisions will be in full force and effect.<\/p>\n\n\n\n<p>11. Certification. You certify that you are at least 18 years of age and that your answers to any registration materials on the Website will be truthful. In accessing and using the Website, you understand and agree that basic information concerning you, given to the Website, may be published on the web-site for others to view.<\/p>\n\n\n\n<p>12. Entire Agreement. This Agreement constitutes your entire Agreement with the Website and MYR Group with respect to the Website and any related services.<\/p>\n\n\n\n<p>13. Waiver. The failure of the Website or MYR Group to exercise or enforce any right or provision of this Agreement shall not operate as a waiver of such right or provision.&nbsp; Any waiver of this Agreement by the Website or MYR Group must be in writing and signed by an authorized representative of MYR Group.<\/p>\n\n\n\n<p>You further understand and agree that clicking or pressing on the &#8220;I agree&#8221; is the electronic equivalent of a written signature on this document.<\/p>\n\n\n\n<p>The Website is owned and operated by:<\/p>\n\n\n\n<p>MYR Group Inc.<\/p>\n\n\n\n<p>12121 Grant St, Suite #610<\/p>\n\n\n\n<p>Thornton, CO 80241<\/p>\n<\/div><\/div>\n\n\n\n<div class=\"wp-block-group\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div class=\"wp-block-group is-style-block-section footer-call-to-action\"><div class=\"wp-block-group__inner-container is-layout-flow wp-block-group-is-layout-flow\">\n<div class=\"wp-block-columns has-myrgroup-blue-background-color has-background is-layout-flex wp-container-core-columns-is-layout-1 wp-block-columns-is-layout-flex\">\n<div class=\"wp-block-column is-vertically-aligned-center is-layout-flow wp-block-column-is-layout-flow\" style=\"flex-basis:66.66%\">\n<h2 class=\"has-white-color has-text-color wp-block-heading\">Strength in Diversity – Explore Our Vendor Program<\/h2>\n<\/div>\n\n\n\n<div class=\"wp-block-column is-vertically-aligned-center is-layout-flow wp-block-column-is-layout-flow\" style=\"flex-basis:33.33%\">\n<div class=\"wp-block-buttons is-layout-flex wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/exiinc.com\/contact\/vendors\/\">LEARN MORE<\/a><\/div>\n<\/div>\n<\/div>\n<\/div>\n<\/div><\/div>\n<\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Website Terms and Conditions of Use These Terms and Conditions of Use (“Agreement”) are a legal agreement between the owner, MYR Group Inc. (“MYR Group”) and the user (“you” or “your”) of the MYR Group website www.exiinc.com (“Website”). Please read this Agreement carefully before accessing or using the Website. By accessing the Website, you agree [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"_acf_changed":false,"footnotes":""},"class_list":["post-1875","page","type-page","status-publish","hentry"],"acf":[],"_links":{"self":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/pages\/1875"}],"collection":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/comments?post=1875"}],"version-history":[{"count":11,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/pages\/1875\/revisions"}],"predecessor-version":[{"id":7078,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/pages\/1875\/revisions\/7078"}],"wp:attachment":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media?parent=1875"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}