{"id":3266,"date":"2022-04-14T13:55:00","date_gmt":"2022-04-14T20:55:00","guid":{"rendered":"https:\/\/myrgroup.com\/news\/myr-group-inc-subsidiary-awarded-timberland-solar-project-with-conedison\/"},"modified":"2022-04-14T13:55:00","modified_gmt":"2022-04-14T20:55:00","slug":"myr-group-inc-subsidiary-awarded-timberland-solar-project-with-conedison","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/myr-group-inc-subsidiary-awarded-timberland-solar-project-with-conedison\/","title":{"rendered":"MYR Group Inc. Subsidiary Awarded Timberland Solar Project with ConEdison"},"content":{"rendered":"\n<div class=\"node__content\">\n          <div class=\"box__wrap\">\n                  <div class=\"box__right\">\n            \n            \n            \n            \n                          <div class=\"file-link pdf-file-link\">\n  <span class=\"file file--mime-application-pdf file--application-pdf\"><a href=\"https:\/\/investor.myrgroup.com\/node\/13996\/pdf\" type=\"application\/pdf\" target=\"_blank\" rel=\"noopener\">PDF Version<\/a><\/span>\n<\/div>\n                      <\/div>\n        \n              <\/div>\n    \n                <p align=\"left\"><location value=\"LU\/us.co.henson\" idsrc=\"xmltag.org\">HENDERSON, Colo.<\/location>, <chron>April  14, 2022<\/chron>  (GLOBE NEWSWIRE) &#8212; <strong><org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group Inc.<\/org> (“<org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group”)<\/org> (NASDAQ: MYRG)<\/strong>, a holding company of leading specialty contractors serving the electric utility infrastructure, commercial and industrial construction markets in <location value=\"LC\/us\" idsrc=\"xmltag.org\">the United States<\/location> and <location value=\"LC\/ca\" idsrc=\"xmltag.org\">Canada<\/location>, announced that <org>MYR Energy Services, Inc.<\/org> (MYRE), an <org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group<\/org> subsidiary, has executed a contract with <org value=\"3895594006\" idsrc=\"xmltag.org\">Con Edison Clean Energy Businesses, Inc.<\/org> (ConEdison CEB) for the <org>Timberland Solar Project<\/org> located in <location value=\"LS\/us.ga\" idsrc=\"xmltag.org\">Georgia<\/location>. The project consists of 194MWdc\/140MWac utility-scale photovoltaic (PV) solar development and new 345kV substation. The contract is valued in excess of <money>$100 million<\/money>.<br><\/p>\n<p>Under the contract, MYRE will provide engineering, procurement, and construction (EPC) services to install more than 380,000 solar modules on a 1,300-acre site and provide construction of the associated substation. The project will break ground in spring 2022 with preconstruction activities to begin immediately. Project completion is scheduled for late 2023.<\/p>\n<p>“MYR Group is proud to play a significant role in this important project, leveraging our technical expertise to deliver superior construction and further elevating our position in the clean energy market,” said <person value=\"2557257713\">Rick Swartz<\/person>, President and Chief Executive Officer of <org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group<\/org>. “This award reflects the strong relationship we have developed with ConEdison CEB and we look forward to enhancing our partnership with them on turnkey, utility-scale solar projects. As an industry leader, we are committed to delivering projects that support ongoing investments in clean energy, improving grid resiliency, and upgrading aging infrastructure.”<\/p>\n<p><strong>About <org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group Inc.<\/org><br><\/strong><org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group<\/org> is a holding company of leading specialty contractors serving the electric utility infrastructure, commercial and industrial construction markets throughout <location value=\"LC\/us\" idsrc=\"xmltag.org\">the United States<\/location> and <location value=\"LC\/ca\" idsrc=\"xmltag.org\">Canada<\/location> who have the experience and expertise to complete electrical installations of any type and size. Their comprehensive services on electric transmission, distribution networks, substation facilities and clean energy projects include design, engineering, procurement, construction, upgrade, maintenance and repair services. Transmission and distribution customers include investor-owned utilities, cooperatives, private developers, government-funded utilities, independent power producers, independent transmission companies, industrial facility owners and other contractors. Through their commercial and industrial division, comprehensive services include electrical design, installation, maintenance and repair on commercial, industrial and clean energy projects. Services are provided to general contractors, commercial and industrial facility owners, local governments, and developers. For more information, visit <a href=\"http:\/\/myrgroup.com\">myrgroup.com<\/a>.<br><\/p>\n<p><strong>About <org value=\"3895594006\" idsrc=\"xmltag.org\">Con Edison Clean Energy Businesses, Inc.<\/org><br><\/strong><org value=\"3895594006\" idsrc=\"xmltag.org\">Con Edison Clean Energy Businesses, Inc.<\/org> (ConEdison CEB) offers a comprehensive portfolio of energy-related solutions, including utility-scale and behind the meter renewable development, construction and operation, battery storage, power marketer and asset management services, and energy efficiency services. Headquartered in <location value=\"LU\/us.ny.vallla\" idsrc=\"xmltag.org\">Valhalla, New York<\/location>, ConEdison CEB is part of the <org value=\"ED\" idsrc=\"xmltag.org\">Consolidated Edison, Inc.<\/org> (NYSE: ED) family of companies, which has a corporate history dating back to 1823. <org value=\"ED\" idsrc=\"xmltag.org\">Consolidated Edison, Inc.<\/org> is the second largest solar energy owner and operator in <location value=\"LB\/nam\" idsrc=\"xmltag.org\">North America<\/location>.<\/p>\n<p><strong>Forward-Looking Statement <\/strong><br><em>This press release (and any oral statements regarding the subject matter of this press release) contains forward-looking statements intended to qualify for the &#8220;safe harbor&#8221; from liability established by the Private Securities Litigation Reform Act of 1995. Forward-looking statements include, but are not limited to: the expected cost of the work under this project, which includes services beyond the services expected to be performed by MYR and MYRE; the scope, services, terms and results of the project to be performed, and the expected time frames for contract award and project completion, as well as statements reflecting expectations, intentions, assumptions or beliefs about future events and other statements that do not relate strictly to historical or current facts. Although MYR’s management believes that the expectations reflected in such forward-looking statements are reasonable, it can give no assurance that such expectations will prove to be correct. These statements can be affected by inaccurate assumptions and by a variety of risks and uncertainties that are difficult to predict or beyond our control, including, among others, the award of the contract for the project and the final terms and conditions of the contract relating to the project; successful performance and completion of the contract and project, including achievement of expected efficiencies; failure to realize the anticipated value of the contract; total costs of the project, which includes permitting, engineering, materials and construction, may be more or less than estimated; the potential for incurrence of damages, schedule delays or performance shortfalls, including as a result of warranty claims following completion; the failure of MYRE’s subcontractors and material suppliers to perform their obligations, including warranty obligations, under their subcontracts; adverse changes in economic conditions and trends in relevant markets; future growth in the electric utility industry; delays or changes in scope of project; the inability of our customer to pay for services; cancellation and termination provisions present in the contract; and other factors affecting the business of the respective parties generally, including risks detailed in MYR’s Annual Report on Form 10-K for the year ended <chron>December 31, 2021<\/chron>, MYR’s subsequent Quarterly Reports on Form 10-Q and any other documents of MYR filed with the <org>Securities and Exchange Commission<\/org> (SEC). Should one or more of these risks materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those expressed or implied in any forward-looking statements. For a discussion of these risks, uncertainties and assumptions, investors are urged to refer to MYR’s documents filed with the <org>SEC<\/org> that are available through MYR’s web site at <a href=\"http:\/\/myrgroup.com\">myrgroup.com<\/a> or through the SEC’s Electronic Data Gathering, Analysis and Retrieval system (EDGAR) at <a href=\"http:\/\/sec.gov\">sec.gov<\/a>. You are cautioned not to place undue reliance on these forward-looking statements, which are current only as of the date of this press release. MYR does not undertake and expressly disclaims any obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. MYR further expressly disclaims any written or oral statements made regarding the subject matter of this press release by any third party. <\/em><\/p>\n<p><strong>Contacts<\/strong><br><person value=\"2905475873\">Betty R. Johnson<\/person>, Chief Financial Officer, <org value=\"MYRG\" idsrc=\"xmltag.org\">MYR Group Inc.<\/org>, (847) 290-1891, <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=pn-dG-RscuyVt2ijw8IVpclKvpkCg-v1WKwO24C-nASBEhIVOrVrIViajHFWgQ5kpSGwFRmtg_CHdte-KZFsTDgtrWpha0apl7Wi4xIL8HA=\" rel=\"nofollow noopener\" target=\"_blank\">investorinfo@myrgroup.com<\/a><\/p>\n<p><person>David Gutierrez<\/person>, <org>Dresner Corporate Services<\/org>, (312) 780-7204, <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=eV5rPBL8uT8jSCV6o_TQ1H7Pp-JloZKZrGMIzJq5IUdXupPqGjcjs05mHfT-jkWyAcnSK4oyTqN0gI9hmPkHW0X5lsL_5R2yrsC4MxxNtlw=\" rel=\"nofollow noopener\" target=\"_blank\">dgutierrez@dresnerco.com<\/a><\/p><img decoding=\"async\" class=\"__GNW8366DE3E__IMG\" src=\"https:\/\/www.globenewswire.com\/newsroom\/ti?nf=ODUyMjg4NSM0ODUyOTM0IzIwMDcwOTY=\"><br><img decoding=\"async\" src=\"https:\/\/ml.globenewswire.com\/media\/YzcyYzA1MzctNDVkOC00MjE0LTk4YTQtYWIzMWZhYzRkNzMxLTEwMTg2Njk=\/tiny\/MYR-Group-Inc-.png\" referrerpolicy=\"no-referrer-when-downgrade\"><p><a href=\"https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/d00ef506-8a60-4ead-8cf0-3754191b99af\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/ml.globenewswire.com\/media\/d00ef506-8a60-4ead-8cf0-3754191b99af\/small\/myr-group-logo.jpg\" border=\"0\" width=\"110\" height=\"51\" alt=\"Primary Logo\"><\/a><\/p>\n<p>\nSource: MYR Group, Inc.<\/p>\n  \n      <\/div>\n","protected":false},"excerpt":{"rendered":"<p>PDF Version HENDERSON, Colo., April 14, 2022 (GLOBE NEWSWIRE) &#8212; MYR Group Inc. (“MYR Group”) (NASDAQ: MYRG), a holding company of leading specialty contractors serving the electric utility infrastructure, commercial and industrial construction markets in the United States and Canada, announced that MYR Energy Services, Inc. (MYRE), an MYR Group subsidiary, has executed a contract [&hellip;]<\/p>\n","protected":false},"author":0,"featured_media":2131,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[116],"class_list":["post-3266","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-press-release"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/3266"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=3266"}],"version-history":[{"count":0,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/3266\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/2131"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=3266"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=3266"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}