{"id":6172,"date":"2022-10-19T11:07:16","date_gmt":"2022-10-19T17:07:16","guid":{"rendered":"https:\/\/myrgroup.com\/?p=6172"},"modified":"2022-10-19T11:07:17","modified_gmt":"2022-10-19T17:07:17","slug":"a-day-in-the-life-it-senior-director-rodrigo-ovalles","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/a-day-in-the-life-it-senior-director-rodrigo-ovalles\/","title":{"rendered":"A Day In the Life: IT Senior Director, Rodrigo Ovalles"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-1600x1600.jpg\" alt=\"\" class=\"wp-image-6174\" width=\"398\" height=\"398\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-1600x1600.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-1024x1024.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-782x782.jpg 782w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-768x768.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-1536x1536.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/MYR-Rodrigo-Ovalles-2022-Headshot-2048x2048.jpg 2048w\" sizes=\"(max-width: 398px) 100vw, 398px\" \/><figcaption>IT Senior Director, Rodrigo Ovalles<\/figcaption><\/figure><\/div>\n\n\n\n<p class=\"has-drop-cap\">We sat down with Rodrigo Ovalles, Senior Director of IT Infrastructure based out of the corporate office in Thornton, Colo., right at his one-year anniversary with MYR Group. With nearly 30 years of experience working as an IT professional, Ovalles moved to Colorado from Miami, excited to work in an industry – and for a company – poised for tremendous transition and growth.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Ovalles gives insight into his role within the IT department and discusses how MYR Group’s IT team provides critical support to the company’s growth in an increasingly digital, technology-driven world. Working in a modern IT industry means embracing a diverse set of skills and experiences, all equally important to ensure the security and future of MYR Group.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What is your role as IT senior director and how is it important to MYR Group?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>As the Senior Director of IT for Infrastructure, one aspect of my role is to ensure end-user satisfaction. Although it sounds simple, it takes many moving parts to achieve this since it entails maintaining our networks, servers, standard end user, and operations platforms and keeping them operational, all while safeguarding our technology platforms from cyber threats. The other aspect of my role is to make sure my team is enabled to succeed. This means having the right technology training, soft skills, and leadership skills to lead their respective teams. <\/p>\n\n\n\n\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What does a typical day look like for you?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>A typical day starts with briefly touching base with our client services team to address any pressing issues. As the day progresses, more complex discussions are had, and decisions are made that can change the direction of our technology landscape since it’s one of the fastest-changing areas of our company. In a nutshell, a typical day is a balancing act between systems vigilance, staff and project management, resourcing, and IT\/business engagement\/partnership support.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: How did you end up in this role?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>I think what attracted me to MYR Group was the opportunity to join a U.S.-based and focused company in a field that is going through tremendous transformation and growth. As clean energy efforts continue to progress, MYR Group, through its numerous subsidiaries, is positioned to grow with the market. This is the type of company anyone should want to join! <\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What do you love most about your job?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>There are many things I love about my job, but what’s most important to me is the opportunity to lead a great group of IT leaders that strive to achieve the best outcomes for the business. I believe that inspired leaders will achieve great outcomes.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: How is the IT department essential to the day-to-day operations of the company?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>Think of where companies were 30+ years ago: fax machines, analog telephones, typewriters, maps to get from point A to point B, and couriers to deliver construction plans to a job site were essential needs. Nowadays, businesses can exchange information, manage projects with complex data applications and drawings, and get from point A to point B with the use of a single mobile device. The IT department is the team responsible for ensuring all this technology is always fully functional and operational, which is essential to the day-to-day operations of the company. IT maintains the heartbeat of the company!&nbsp;&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"1000\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Rodrigo_Day_In_The_Life-3-1-1600x1000.jpg\" alt=\"\" class=\"wp-image-6178\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Rodrigo_Day_In_The_Life-3-1-1600x1000.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Rodrigo_Day_In_The_Life-3-1-1024x640.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Rodrigo_Day_In_The_Life-3-1-768x480.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Rodrigo_Day_In_The_Life-3-1-1536x960.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2022\/10\/Rodrigo_Day_In_The_Life-3-1-2048x1280.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What’s it like managing a team with such a diverse set of experience, skills, and personalities?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>The department has transformed the way we function as a team. A couple of months ago, we made a strategic decision to change our structure and split the team in two: the technology architectural team and an IT operations team. This strategy has paid off since it allows us to support two different technology needs. One is to implement the right technology platforms for our environment and the other is to support the day-to-day company operations.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Both needs require a diverse group of technologists with different skill sets and experience (networking, cloud, servers, storage, security, and compliance). As far as personalities, each person in the team is as unique as they can be, which is what makes this group a highly diverse team inspiring creativity and innovation.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: Why do you think somebody in the IT field should want to join your team at MYR Group?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>This is a great time to join MYR Group, not only in the technology space but in any function. A great part of our current roadmap is to drive digital transformation. This type of transformation requires expertise, focus, and the desire to change how a company leverages data. This is an exciting time to join our team and become part of the success story we are building behind our transformation initiatives.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What skills and\/or traits do you think are important for somebody working in our IT department?<\/strong>&nbsp;&nbsp;<\/h2>\n\n\n\n<p>There are many great IT professionals in our workforce. Many have great technology skills and traits, but what’s most important to me is to have a winning attitude. This type of attitude drives the desire to do better, to not give up and determination to achieve a goal. These are not things you learn in college or in a university. Winners are not born, they are made. To become a winner, you have to be in the game, play the game with the team, and strive for results.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We sat down with Rodrigo Ovalles, Senior Director of IT Infrastructure based out of the corporate office in Thornton, Colo., right at his one-year anniversary with MYR Group. With nearly 30 years of experience working as an IT professional, Ovalles moved to Colorado from Miami, excited to work in an industry – and for a [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":6173,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[120],"class_list":["post-6172","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-a-day-in-the-life"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/6172"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=6172"}],"version-history":[{"count":4,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/6172\/revisions"}],"predecessor-version":[{"id":6179,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/6172\/revisions\/6179"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/6173"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=6172"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=6172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}