{"id":8806,"date":"2024-06-10T10:42:42","date_gmt":"2024-06-10T16:42:42","guid":{"rendered":"https:\/\/myrgroup.com\/?p=8806"},"modified":"2024-08-20T09:41:13","modified_gmt":"2024-08-20T15:41:13","slug":"harlan-electric-company-saves-detroit-animal-shelter-from-shutdown-with-generous-donation","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/harlan-electric-company-saves-detroit-animal-shelter-from-shutdown-with-generous-donation\/","title":{"rendered":"Harlan Electric Company Saves Detroit Animal Shelter from Shutdown with Generous Donation"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Rochester Hills District Pays Energy Bill for Local Detroit Shelter in Need<\/h2>\n\n\n\n<p class=\"has-drop-cap\">In a heartwarming display of community support, Harlan Electric Company has stepped in to save the day for&nbsp;<a href=\"https:\/\/makeadifferencerescue.com\/\">Make A Difference Rescue<\/a>, a crucial no-kill animal shelter in Detroit. Facing a dire financial crisis that threatened its operations, the shelter received a lifeline in the form of a generous donation from Harlan Electric Company.<\/p>\n\n\n\n<p>Make A Difference Rescue, located in the heart of Detroit, has been a beacon of hope for abandoned and neglected animals for years. Specializing in rescuing Pitbulls and other bully breeds, the shelter works tirelessly to provide a safe haven for these animals who often suffer at the hands of neglectful owners.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-full is-resized\"><img decoding=\"async\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/06\/Harlan-Dog-Rescue-Dog-Photo.jpg\" alt=\"\" class=\"wp-image-8874\" width=\"-123\" height=\"-164\"\/><\/figure><\/div>\n\n\n<p>This shelter plays a vital role in the community, working closely with local law enforcement to rescue dogs from the streets and provide them with the care and love they deserve.<\/p>\n\n\n\n<p>The shelter, which relies heavily on donations to sustain its operations, was facing imminent closure due to financial difficulties.&nbsp;<\/p>\n\n\n\n<p>A poignant Facebook post shared by the shelter served as a rallying cry for support: &#8220;Emergency post!!!&nbsp; If we can&#8217;t come up with $7,928.59 by April 17, 2024, we are at risk of losing our electricity at the shelter. Inflation has taken a toll on us, along with many unforeseen medical cases, and we are having a hard time keeping up with it all. We know we are not the only ones having financial problems, but our shelter is full and these dogs rely on us. We cannot bear the thought of not being here for the dogs that have been left for dead in Detroit. We love each and every one of them. Please help us help them.&#8221;<\/p>\n\n\n\n<p>Collin Vervinck, a project engineer at Harlan Electric Company, and a dedicated dog owner himself, stumbled upon the post and brought it to the attention of his colleagues, Adam Segers and Chad Pioletti. With over 90 percent of the office personnel being dog owners, the decision to help was immediate.<\/p>\n\n\n\n<p>&#8220;We saw the post, and it just struck a chord with us,&#8221; explained Vervinck. &#8220;We knew we had to do something to help keep the shelter&#8217;s doors open.&#8221;<\/p>\n\n\n\n<p>With time running out and the shelter facing a looming deadline to pay its overdue electrical bill, Harlan Electric Company wasted no time in springing into action. Within days, they had sent the remaining $7,384.08 needed to settle the bill and ensure the shelter&#8217;s continued operation.<\/p>\n\n\n\n<p>&#8220;It wasn&#8217;t even a question for us,&#8221; said Segers, reflecting on the decision to donate. &#8220;We all love dogs and knowing that we could make a difference for these animals meant everything to us.&#8221;<\/p>\n\n\n\n<p>The donation from Harlan Electric Company not only saved Make A Difference Rescue from closure but also renewed hope for the countless animals who rely on the shelter for their survival. As Detroit continues to grapple with issues surrounding animal welfare, acts of kindness like this serve as a reminder of the power of community<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rochester Hills District Pays Energy Bill for Local Detroit Shelter in Need In a heartwarming display of community support, Harlan Electric Company has stepped in to save the day for&nbsp;Make A Difference Rescue, a crucial no-kill animal shelter in Detroit. Facing a dire financial crisis that threatened its operations, the shelter received a lifeline in [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":8807,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[93],"class_list":["post-8806","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-community-involvement","subsidiary-harlan-electric"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8806"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=8806"}],"version-history":[{"count":3,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8806\/revisions"}],"predecessor-version":[{"id":8876,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8806\/revisions\/8876"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/8807"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=8806"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=8806"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}