{"id":5173,"date":"2022-08-02T14:07:00","date_gmt":"2022-08-02T20:07:00","guid":{"rendered":"https:\/\/myrgroup.com\/news\/myr-group-inc-announces-intention-to-declassify-its-board-of-directors\/"},"modified":"2022-08-02T14:07:00","modified_gmt":"2022-08-02T20:07:00","slug":"myr-group-inc-announces-intention-to-declassify-its-board-of-directors","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/myr-group-inc-announces-intention-to-declassify-its-board-of-directors\/","title":{"rendered":"MYR Group Inc. Announces Intention to Declassify its Board of Directors"},"content":{"rendered":"\n<div class=\"node__content\">\n          <div class=\"box__wrap\">\n                  <div class=\"box__right\">\n            \n            \n            \n            \n                          <div class=\"file-link pdf-file-link\">\n  <span class=\"file file--mime-application-pdf file--application-pdf\"><a href=\"https:\/\/investor.myrgroup.com\/node\/14226\/pdf\" target=\"_blank\" rel=\"noopener\">PDF Version<\/a><\/span>\n<\/div>\n                      <\/div>\n        \n              <\/div>\n    \n                <p align=\"left\">HENDERSON, Colo., Aug.  02, 2022  (GLOBE NEWSWIRE) &#8212; <strong>MYR Group Inc. (“MYR Group” or the “Company”) (NASDAQ: MYRG)<\/strong>, a holding company of leading specialty contractors serving the electric utility infrastructure, commercial and industrial construction markets in the United States and Canada, announced today that its Board of Directors (the “Board”) intends to put forward a proposal to the Company’s stockholders for a vote at its 2023 Annual Meeting of Stockholders (the &#8220;2023 Annual Meeting&#8221;) to declassify the Board and transition to an annual election of directors. The Company also announced that the Board has approved amendments to the Company’s Corporate Governance Principles establishing the general policy of a fifteen-year term limit for directors with the goal of furthering the Board’s commitment to Board diversity and refreshment.<br><\/p>\n<p>The Company expects to detail the proposal to declassify the Board in its proxy statement for the 2023 Annual Meeting, which will be filed with the Securities and Exchange Commission in advance of the 2023 Annual Meeting.<\/p>\n<p>This press release is being provided for informational purposes only and does not constitute the solicitation of any vote for approval of any proposal.<\/p>\n<p><strong>About MYR Group Inc.<\/strong><br>MYR Group is a holding company of leading, specialty electrical contractors providing services throughout the United States and Canada through two business segments: Transmission &amp; Distribution (“T&amp;D”) and Commercial &amp; Industrial (“C&amp;I”). MYR Group subsidiaries have the experience and expertise to complete electrical installations of any type and size. Their comprehensive T&amp;D services on electric transmission, distribution networks, substation facilities and clean energy projects include design, engineering, procurement, construction, upgrade, maintenance and repair services. T&amp;D customers include investor-owned utilities, cooperatives, private developers, government-funded utilities, independent power producers, independent transmission companies, industrial facility owners and other contractors. Through their C&amp;I segment, they provide a broad range of services which include the design, installation, maintenance and repair of commercial and industrial wiring generally for airports, hospitals, data centers, hotels, stadiums, commercial and industrial facilities, clean energy projects, manufacturing plants, processing facilities, water\/waste-water treatment facilities, mining facilities, intelligent transportation systems, and roadway lighting and signalization. C&amp;I customers include general contractors, commercial and industrial facility owners, government agencies and developers. For more information, visit <a href=\"http:\/\/myrgroup.com\">myrgroup.com<\/a>.<\/p>\n<p><strong>Forward-Looking Statements<\/strong><br><em>Various statements in this announcement, including those that express a belief, expectation, or intention, as well as those that are not statements of historical fact, are forward-looking statements. The forward-looking statements may include projections and estimates concerning the timing and success of specific projects and our future production, revenue, income, capital spending, segment improvements and investments. Forward-looking statements are generally accompanied by words such as “anticipate,” “believe,” “estimate,” “expect,” “intend,” “likely,” “may,” “objective,” “outlook,” “plan,” “project,” “possible,” “potential,” “should,” “unlikely,” or other words that convey the uncertainty of future events or outcomes. The forward-looking statements in this announcement speak only as of the date of this announcement. We disclaim any obligation to update these statements (unless required by securities laws), and we caution you not to rely on them unduly. We have based these forward-looking statements on our current expectations and assumptions about future events. While our management considers these expectations and assumptions to be reasonable, they are inherently subject to significant business, economic, competitive, regulatory and other risks, contingencies and uncertainties, most of which are difficult to predict and many of which are beyond our control. No forward-looking statement can be guaranteed and actual results may differ materially from those projected. Forward-looking statements in this announcement should be evaluated together with the many uncertainties that affect MYR’s business, particularly those mentioned in the risk factors and cautionary statements in Item 1A. of MYR’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021, and in any risk factors or cautionary statements contained in MYR’s subsequent Quarterly Reports on Form 10-Q or Current Reports on Form 8-K.<\/em><\/p>\n<p><strong>Contacts<\/strong><br>Betty R. Johnson, Chief Financial Officer, MYR Group Inc., (847) 290-1891, <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=K0UUgvYR5Hr0Jko5-oDI0Rm-h0OBaDMFNBtTe7qJSj213IRb5p4WfJ-Cnzx80T-BmEri9XI8Lvuitgo8IE8rwiUqb-XJJsMiHrAADHu6mEw=\" rel=\"nofollow noopener\" target=\"_blank\">investorinfo@myrgroup.com<\/a><\/p>\n<p>David Gutierrez, Dresner Corporate Services, (312) 780-7204, <a href=\"https:\/\/www.globenewswire.com\/Tracker?data=-_4c7N4sFkKMJjfKrrkd0OzonzmQKjmKj5_vXC1HOjs7hXiErAhpx7oDAhKCZ5MFXgNfk0AdLxk-lH99kyyR3OTrdFbIMiUwlce1yaK7K0c=\" rel=\"nofollow noopener\" target=\"_blank\">dgutierrez@dresnerco.com<\/a><\/p>\n<img decoding=\"async\" class=\"__GNW8366DE3E__IMG\" src=\"https:\/\/www.globenewswire.com\/newsroom\/ti?nf=ODYxMDk2MSM1MDY4OTI4IzIwMDcwOTY=\"><br><img decoding=\"async\" src=\"https:\/\/ml.globenewswire.com\/media\/YzZjZGY5MGItMzgwZS00ZDc2LTk5MjItMjBiYjExOWFlOTA2LTEwMTg2Njk=\/tiny\/MYR-Group-Inc-.png\"><p><a href=\"https:\/\/www.globenewswire.com\/NewsRoom\/AttachmentNg\/d00ef506-8a60-4ead-8cf0-3754191b99af\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/ml.globenewswire.com\/media\/d00ef506-8a60-4ead-8cf0-3754191b99af\/small\/myr-group-logo.jpg\" border=\"0\" width=\"110\" height=\"51\" alt=\"Primary Logo\"><\/a><\/p>\n<p>\nSource: MYR Group, Inc.<\/p>\n  \n      <\/div>\n","protected":false},"excerpt":{"rendered":"<p>PDF Version HENDERSON, Colo., Aug. 02, 2022 (GLOBE NEWSWIRE) &#8212; MYR Group Inc. (“MYR Group” or the “Company”) (NASDAQ: MYRG), a holding company of leading specialty contractors serving the electric utility infrastructure, commercial and industrial construction markets in the United States and Canada, announced today that its Board of Directors (the “Board”) intends to put [&hellip;]<\/p>\n","protected":false},"author":0,"featured_media":2131,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[116],"class_list":["post-5173","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-press-release"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/5173"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=5173"}],"version-history":[{"count":0,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/5173\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/2131"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=5173"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=5173"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}