{"id":8058,"date":"2024-01-17T09:45:20","date_gmt":"2024-01-17T16:45:20","guid":{"rendered":"https:\/\/myrgroup.com\/?p=8058"},"modified":"2024-10-11T15:23:13","modified_gmt":"2024-10-11T21:23:13","slug":"sturgeon-electric-conquers-complex-denver-international-airport-concourse-expansion","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/sturgeon-electric-conquers-complex-denver-international-airport-concourse-expansion\/","title":{"rendered":"Sturgeon Electric Conquers Complex Denver International Airport Concourse Expansion"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">Communication, teamwork, and commitment to safety drive project success at one of the world’s busiest airports<strong>&nbsp;<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"900\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/07-DEN-Ace-Award-Entry-photos-1600x900.jpg\" alt=\"Exterior of Denver International Airport\" class=\"wp-image-8060\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/07-DEN-Ace-Award-Entry-photos-1600x900.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/07-DEN-Ace-Award-Entry-photos-1024x576.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/07-DEN-Ace-Award-Entry-photos-768x432.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/07-DEN-Ace-Award-Entry-photos-1536x864.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/07-DEN-Ace-Award-Entry-photos-2048x1152.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><figcaption class=\"wp-element-caption\">Sturgeon Electric takes on Denver Airport&#8217;s massive concourse project<\/figcaption><\/figure>\n\n\n\n<p>Denver International Airport (DEN) is one of the busiest airports in the world. As with all airports, performing any kind of construction in this type of environment comes with high-security needs and unique logistical challenges for contractors and vendors navigating active airfields and taxiways. &nbsp;<\/p>\n\n\n\n<p>Sturgeon Electric Company, Inc. (Sturgeon Electric) eagerly accepted the challenge when the company secured two concourse expansions at DEN that would be built concurrently with two separate general contractors. One being the Concourse A-West Expansion with joint-venture general contracting partners, Turner Construction Company and Flatiron Construction Corp, valued clients. The 530,000-square-foot airport concourse expansion added 12 new gates (domestic and international) and 16 hold rooms. It also included refreshing four existing gates, building a de-icing facility, and adding security features needed for a sterile corridor which serves gates for international flights.  &nbsp;<\/p>\n\n\n\n<p>Managing and performing construction for a project of this scale is complex, and unexpected challenges with ever-changing pandemic regulations, subsequent, unforeseen supply chain disruptions and a steady stream of project changes effectively doubled the project scope.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Due to the magnitude of the project, Sturgeon Electric had up to 200 people on-site during the peak of construction in addition to 33 trade partners. With so many involved, Sturgeon Electric was focused on being the nucleus between all trade partners, the general contractor, the design team, and the customer to ensure successful project delivery. &nbsp;<\/p>\n\n\n\n<p>Despite all this, Sturgeon Electric succeeded in delivering project excellence. The team provided safe, efficient, and high-quality work, meeting multiple deadlines and receiving accolades from former Denver Mayor Michael Hancock for diverse vendor utilization.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Preparation and Communication Enable Success Despite Numerous Changes<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Sturgeon Electric’s scope of work encompassed all the electrical distribution, from mechanical power and life safety systems (such as fire alarms and emergency communication systems) to lightning protection, rooftop solar, technology systems, fiber optics and more. Sturgeon Electric self-performed much of the work and relied on a superior team including many diverse small business trade partners for the remaining scope as part of Denver’s Diverse Vendor Utilization program.&nbsp;<\/p>\n\n\n\n<p>Because in construction, one change begets another, changes during the project affected not only Sturgeon Electric, but its 33 trade partners as well – making collaboration and coordination even more essential.&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignleft size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"900\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/09-DEN-Ace-Award-Entry-photos-1600x900.jpg\" alt=\"Interior terminal of Denver International Airport\" class=\"wp-image-8062\" style=\"width:539px;height:303px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/09-DEN-Ace-Award-Entry-photos-1600x900.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/09-DEN-Ace-Award-Entry-photos-1024x576.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/09-DEN-Ace-Award-Entry-photos-768x432.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/09-DEN-Ace-Award-Entry-photos-1536x864.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/09-DEN-Ace-Award-Entry-photos-2048x1152.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure><\/div>\n\n\n<p>Successfully navigating hundreds of changes that effectively doubled the project scope would not have been possible without Sturgeon Electric’s dedicated field and office staff maintaining standardized processes and constant communication between all parties. &nbsp;<\/p>\n\n\n\n<p>“As an electrical contractor, we touch every part of the project,” said Jon Brender, a Sturgeon Electric Operations Manager, “We really had our hands full dealing with the amount of change that was put in front of us all … It was really an effort to keep up with the real-time installations and how that related to the changes that were being put into place.” &nbsp;<\/p>\n\n\n\n<p>Successfully managing a project of this magnitude and delivering the project on deadline required detailed document control, close coordination with other trades and partners (at both office and field levels), integrated schedules, change management tracking, quality control, inspection processes, and the utilization of additional supervision and leadership.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Unwavering Commitment to Safety&nbsp;<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Even in the face of so many variables, Sturgeon Electric maintained its focus on safety, and the project greatly benefitted from the entire team’s commitment to keeping themselves and each other safe.&nbsp;<\/p>\n\n\n\n<p>Many individuals on the project stepped up to ensure a safe work environment, from the Sturgeon Electric employee who ran the lockout\/tagout program by following procedures methodically, to the senior superintendent committed to continuous improvement. Countless employees also submitted safety observation reports and directly contributed to a stellar safety record on this multi-year project.&nbsp;<\/p>\n\n\n\n<p>Not only did Sturgeon Electric’s teams keep safety at the forefront of their own work, but they promoted a strong overall safety culture for the entire project. They provided certain training programs to all contributing trades, no matter what type of work those trades were providing on the project. The team also regularly invited speakers to talk about safety or share a safety video with all the foremen and general foremen to facilitate discussions for continuous improvement.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Mayor Applauds Sturgeon Electric for Diversity Participation<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Former Denver Mayor Michael Hancock <a href=\"https:\/\/sturgeonelectric.com\/wp-content\/uploads\/2023\/01\/Sturgeon-Electric-Letter-From-the-Mayor.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">wrote a letter<\/a> to Brian Ablanczy, Sturgeon Electric’s Operations Manager overseeing the two DEN Concourse projects, mid-way through the expansion. He recognized Sturgeon Electric for its commitment and participation in the <a href=\"https:\/\/myrgroup.com\/news\/myr-group-subsidiary-sturgeon-electric-embraces-diverse-vendor-utilization-program-on-denver-international-airport-project\/\" target=\"_blank\" rel=\"noreferrer noopener\">city’s diverse vendor program<\/a> on the Concourse A-West expansion project, as well as the Concourse C-East expansion.&nbsp;&nbsp;<\/p>\n\n\n\n<p>On both projects, Sturgeon Electric relied on many diverse trade partners. For the DEN A-West project, that included MBR Electric Inc., North\/Western Electrical Corp. of CO, St. Andrews Construction, III D Electric, and Servitech, just to name a few.&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"900\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/06-DEN-Ace-Award-Entry-photos-1600x900.jpg\" alt=\"Solar panels on a roof at Denver International Airport\" class=\"wp-image-8063\" style=\"width:567px;height:319px\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/06-DEN-Ace-Award-Entry-photos-1600x900.jpg 1600w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/06-DEN-Ace-Award-Entry-photos-1024x576.jpg 1024w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/06-DEN-Ace-Award-Entry-photos-768x432.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/06-DEN-Ace-Award-Entry-photos-1536x864.jpg 1536w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/01\/06-DEN-Ace-Award-Entry-photos-2048x1152.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure><\/div>\n\n\n<p>Servitech CEO Monika Stenger said that working with Sturgeon Electric over the past seven years has been an “amazing experience” marked by trust and collaboration. Her company was subcontracted to perform the low voltage infrastructure on the DEN A-West project where she says they weathered the challenges as a team and developed solutions together.&nbsp;<\/p>\n\n\n\n<p>St. Andrews Construction, which installed the entire fire alarm system in the DEN A-West expansion, has worked with Sturgeon Electric for roughly 20 years. St. Andrews’ Vice President Steve Wren said that communication and teamwork, between Sturgeon Electric and all the other trade partners was essential to succeeding on the project – especially given the level of changes.&nbsp;<\/p>\n\n\n\n<p>While the city requires participation on government contract work, Bryce Perkins, Vice President of Sturgeon Electric’s Colorado Commercial and Industrial division, sees the diverse vendor utilization program as far more than a requirement. For Sturgeon Electric, it’s an opportunity to provide guidance and mentorship for smaller businesses to further enhance their skillsets and capabilities, to collaborate and learn from each other, and collectively make a significant, positive impact on the state’s electrical industry.&nbsp;<\/p>\n\n\n\n<p><strong>Project Details:<\/strong> <a href=\"https:\/\/sturgeonelectric.com\/projects\/denver-international-airport-dia\/\">Denver International Airport (DEN)<\/a><\/p>\n\n\n\n<p><strong>From complex commercial projects like this one, to data centers and smart hospitals, discover how our companies deliver the highest quality electrical services to Commercial and Industrial customers.<\/strong><\/p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/myrgroup.com\/capabilities\/commercial-industrial-construction\/\">Commercial and Industrial Services<\/a><\/div>\n<\/div>\n\n\n\n\n","protected":false},"excerpt":{"rendered":"<p>Communication, teamwork, and commitment to safety drive project success at one of the world’s busiest airports&nbsp; Denver International Airport (DEN) is one of the busiest airports in the world. As with all airports, performing any kind of construction in this type of environment comes with high-security needs and unique logistical challenges for contractors and vendors [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":8060,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[90],"class_list":["post-8058","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-all-news-stories","subsidiary-sturgeon-electric"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8058"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=8058"}],"version-history":[{"count":9,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8058\/revisions"}],"predecessor-version":[{"id":9381,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8058\/revisions\/9381"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/8060"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=8058"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=8058"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}