{"id":8912,"date":"2024-07-11T12:49:00","date_gmt":"2024-07-11T18:49:00","guid":{"rendered":"https:\/\/myrgroup.com\/?p=8912"},"modified":"2024-08-20T09:40:59","modified_gmt":"2024-08-20T15:40:59","slug":"a-day-in-the-life-safety-manager-clint-spencer","status":"publish","type":"post","link":"https:\/\/myrgroup.com\/news\/a-day-in-the-life-safety-manager-clint-spencer\/","title":{"rendered":"A Day in the Life: Safety Manager, Clint Spencer"},"content":{"rendered":"<div class=\"wp-block-image\">\n<figure class=\"alignright size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/07\/Day-In-the-Life-Clint-Spencer-Headshot-1474x1600.jpg\" alt=\"\" class=\"wp-image-8914\" width=\"241\" height=\"261\" srcset=\"https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/07\/Day-In-the-Life-Clint-Spencer-Headshot-1474x1600.jpg 1474w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/07\/Day-In-the-Life-Clint-Spencer-Headshot-943x1024.jpg 943w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/07\/Day-In-the-Life-Clint-Spencer-Headshot-768x834.jpg 768w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/07\/Day-In-the-Life-Clint-Spencer-Headshot-1415x1536.jpg 1415w, https:\/\/myrgroup.com\/wp-content\/uploads\/2024\/07\/Day-In-the-Life-Clint-Spencer-Headshot-1887x2048.jpg 1887w\" sizes=\"(max-width: 241px) 100vw, 241px\" \/><figcaption class=\"wp-element-caption\"><em>Clint Spencer is a safety manager for Sturgeon Electric.<\/em><\/figcaption><\/figure><\/div>\n\n\n<p class=\"has-drop-cap\">In his 14 years working for MYR Group, Clint Spencer – a safety manager for Sturgeon Electric’s Colorado district – has witnessed tremendous growth in health and safety, as well as the company’s commitment to advancing safety practices. From serving as safety specialist to managing his own team, Clint has learned a lot about how forming effective relationships and empowering crew members helps keep everyone stay safe on the job site.<\/p>\n\n\n\n<p>Read on to discover more about the life of a safety manager, Clint&#8217;s primary responsibilities, and what he appreciates about the crucial role he plays in his team’s well-being.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What is the purpose of your role as a safety manager and how has that evolved from being a safety specialist?<\/strong> <\/h3>\n\n\n\n<p>A safety specialist works out in the field with the crews and makes sure that they&#8217;re following not only our policies, but OSHA rules and regulations and those of our customers on a daily basis. As a safety manager, I supervise a team of safety specialists, supporting them to perform their work to the best of their abilities. And I still get out in the field almost every day as well to go visit with the crews. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How has your experience as a safety specialist, and working your way up, benefited you in your current role?<\/strong> <\/h3>\n\n\n\n<p>All the education that I&#8217;ve gotten over the years has been a great benefit to my career. Going and getting various OSHA certifications and learning how to manage people and how to deal with people on a daily basis has been extremely valuable. Everybody in the field and every crew is different. Figuring out how to approach them when a safety issue does come up, and how to help them correct any issues that we might find, is something I’ve had to learn. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What does the day-to-day look like in your position?<\/strong><\/h3>\n\n\n\n<p>In the mornings I greet the crews, figure out where people are working, and see what work is happening that day. Then I get on my computer, answer emails, and usually have plenty of meetings. I wrap all of that up and then I always try to get out and go visit with one or two crews if I have the time throughout the day to keep building those relationships.&nbsp;<\/p>\n\n\n\n<p>When I&#8217;m in the office, I&#8217;m also going through our new system, Power BI, which is tracking all our job site safety reviews that my safety specialists perform. I&#8217;ll get on there and look at some of the analytics and statistics of things that we need to improve upon and help develop the upcoming safety meetings that we hold. <\/p>\n\n\n\n<blockquote class=\"wp-block-quote has-text-align-center is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-text-align-center\"><strong>&#8220;As a safety manager, I supervise a team of safety specialists, supporting them to perform their work to the best of their abilities.&#8221;<\/strong><\/p>\n<cite>-Clint Spencer<\/cite><\/blockquote>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Explain the new Power BI technology and how it is helping you do your job better.<\/strong><\/h3>\n\n\n\n<p>When we&#8217;re out with the crews, we always audit them. We go through vans, make sure all fire extinguishers are in compliance, ensure sites are clean and safe, and check that all safety rules and regulations are being followed. Power BI takes all the Job site Safety Reviews (JSSRs) and\/or crew audits and filters it all out, or we can go in there and filter it as desired. Then it shows us what we need to do and how we can learn from it. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What do you like most about your role? What&#8217;s most fulfilling or interesting for you?<\/strong><\/h3>\n\n\n\n<p>I think there are a couple of things. One is helping my team learn and grow. I was always told from the beginning to teach them my role so that they can advance their careers. And so, I really like coaching them, teaching them, showing them what I know, and leading them to the education that they need.&nbsp;<\/p>\n\n\n\n<p>And second, I also really like being out in the field and helping and empowering our crews in making the right decisions. I&#8217;d say we have the trust in our crews and in our foremen to be honest with us when they have an issue or see something that&#8217;s unsafe. They call us out there to help them make decisions about the best way to safely do the job and how to apply those lessons moving forward.&nbsp;<\/p>\n\n\n\n<p>We always tell everybody they have a voice. If they see something unsafe, stop the work and get a hold of me or my team, and we’ll come out and work with them to come up with the best, safest solution. I&#8217;ve seen the shift since I&#8217;ve started that our crews use us more than they used to and feel empowered to call us. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>In what ways are safety managers essential to the operations of our company?<\/strong><\/h3>\n\n\n\n<p>We&#8217;re there to help operations. We&#8217;re not out there to bust people for doing something wrong. I would much rather see them doing good things and commend them for those good things. We&#8217;re there to help them do that. Of course, if there is a safety incident or an injury, we step in, and we&#8217;ll be the liaison between the operational side and the safety side and help the employee through every step of that. We&#8217;re just there to help our people in any way that we can and to keep this company as safe as possible.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote has-text-align-center is-layout-flow wp-block-quote-is-layout-flow\">\n<p class=\"has-text-align-center\"><strong>&#8220;I really like being out in the field and helping and empowering our crews in making the right decisions.&#8221;<\/strong><\/p>\n<cite>-Clint Spencer<\/cite><\/blockquote>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What skills or traits are needed to be a good safety manager?<\/strong><\/h3>\n\n\n\n<p>Knowing not only our rules and our policies, but also state and federal policies. OSHA is the bare minimum, and we go above and beyond those standards as an organization. So, you need to know all the ways we approach safety and the higher standards we hold ourselves to beyond OSHA regulations. Also, being ready to share that knowledge with my team is important, too. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>What stands out to you about the culture at Sturgeon Electric and MYR Group?<\/strong><\/h3>\n\n\n\n<p>I think safety has come a long way. I can remember when I started, I think we had roughly 25 or 30 people in the safety department. Now I know we have well over 100 safety professionals companywide. So, it&#8217;s definitely grown a bunch in the 14 years I&#8217;ve been here. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>You mentioned how important your role as a mentor is to you. Did you find that there were people like that for you when you were first starting out in your position?<\/strong> <\/h3>\n\n\n\n<p>Yes, I did. My manager at the time took me under his wing and showed me the proper way to do things, how to deal with people, and how to make things right without causing friction between operations and safety. I feel that safety and our department has grown in MYR Group over the years, and I think we do a pretty good job of it. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>In his 14 years working for MYR Group, Clint Spencer – a safety manager for Sturgeon Electric’s Colorado district – has witnessed tremendous growth in health and safety, as well as the company’s commitment to advancing safety practices. From serving as safety specialist to managing his own team, Clint has learned a lot about how [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":8913,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[120,90],"class_list":["post-8912","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-a-day-in-the-life","category-all-news-stories","subsidiary-sturgeon-electric"],"acf":[],"_links":{"self":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8912"}],"collection":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/comments?post=8912"}],"version-history":[{"count":11,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8912\/revisions"}],"predecessor-version":[{"id":8925,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/posts\/8912\/revisions\/8925"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media\/8913"}],"wp:attachment":[{"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/media?parent=8912"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/myrgroup.com\/wp-json\/wp\/v2\/categories?post=8912"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}