{"id":1199,"date":"2021-07-28T12:00:16","date_gmt":"2021-07-28T18:00:16","guid":{"rendered":"https:\/\/exiinc.com\/?p=1199"},"modified":"2022-09-21T15:58:38","modified_gmt":"2022-09-21T21:58:38","slug":"a-day-in-the-life-project-manager-amy-arnold","status":"publish","type":"post","link":"https:\/\/exiinc.com\/news\/a-day-in-the-life-project-manager-amy-arnold\/","title":{"rendered":"A Day in the Life: Project Manager, Amy Arnold"},"content":{"rendered":"\n<h3 class=\"wp-block-heading\"><strong><span class=\"has-inline-color has-myrgroup-blue-color\">PERSERVERANCE, TEAMWORK, AND KEEPING COOL UNDER PRESSURE ARE KEY ATTRIBUTES TO LEARNING, LEADING EFFECTIVELY, AND EARNING YOUR CREW’S TRUST<\/span><\/strong><\/h3>\n\n\n\n<p>Buried in the gusty Tehachapi mountains of California, lies one of the largest wind farms in the world. Among approximately 5,600 wind turbines is Amy Arnold, project manager of renewable projects for CSI Electrical Contractors, Inc. (CSI Electrical Contractors)<\/p>\n\n\n\n<p>Amy leads construction crews in performing electrical work for the underground collection systems for 17 of these turbines. We caught up with her between outages to learn about her experience, values, and the future of renewable energy.<\/p>\n\n\n\n<p><strong>HOW LONG HAVE YOU BEEN WITH CSI AND HOW HAS YOUR ROLE THERE EVOLVED?<\/strong><\/p>\n\n\n\n<p>I worked with CSI in previous roles and about five and a half years ago, I was recruited by CSI to join their team as a project manager. At the time, I didn’t have a background in engineering or electricity, but I was excited be part of a team that had great potential for growth. Over time I have learned and evolved by being present on jobsites and always having a trained electrician at my side. In our renewables group, we have a core team of “usual suspects” that travel from project to project together. We have worked together for most of my career with the company and I am grateful to be part of such an amazing team.<\/p>\n\n\n\n<p><strong>WHAT DOES A TYPICAL DAY LOOK LIKE FOR YOU?<\/strong><\/p>\n\n\n\n<p>I thrive being on the road and project sites with my team. We have been very busy for over a year managing large-scale utility renewable projects. Every day is unique and different in this role. My general tasks include managing the responsibilities of the entire project, such as construction duties, labor resources, safety, budgets, schedules, and maintaining client relationships. I try to be proactive by understanding potential challenges and creating plans to mitigate those challenges and issues.<\/p>\n\n\n\n<p><strong>WHAT ATTRIBUTES ARE IMPORTANT FOR SOMEONE TO HAVE AS A PROJECT MANAGER?<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\"><li><strong>Perseverance: <\/strong>I try to exhibit strong perseverance professionally and personally. I never use phrases like, “We can’t do it” because we <em>can <\/em>do it! I don’t give up in any area of my life and if I illustrate this on the jobsite, my team feeds off my perseverance. If I maintain a positive attitude, they will too, and we <em>will <\/em>achieve our goals! <strong><\/strong><\/li><li><strong>Leadership: <\/strong>leadership encompasses more than just leading a project. I am not only responsible for the workload and construction duties, but I’m also responsible for the safety and lives of my team. It is my job to make sure everyone returns home safely. Another aspect of leadership is truly getting to know my team and learning how to lead them properly. I focus on getting to know my team members and treating them fairly &#8212; people want to work with me and that is something I’m proud of. <strong><\/strong><\/li><li><strong>Ability to perform under extreme pressure and stress:<\/strong> This speaks for itself. Being on a jobsite with sometimes hundreds of crew members can be overwhelming. I have learned to turn that stress into a motivator to complete projects successfully, in a timely fashion, and on-budget. <strong><\/strong><\/li><\/ul>\n\n\n\n<p><strong>WHY IS YOUR ROLE IMPORTANT FOR THE GENERAL PUBLIC?<\/strong><\/p>\n\n\n\n<p>Clean energy is the way of the future. It is an important factor for our environmental and economic health. The projects we’re working on are large scale and they create a lot of job opportunities for the communities near our projects. This is especially important and apparent in the remote locations where we work. Our projects create jobs for the people that live in these small, rural villages, which is important for their families, their community, and their livelihood.<\/p>\n\n\n\n<p><strong>WHAT IS SOMETHING UNIQUE OR DIFFERENT ABOUT THIS ROLE?<\/strong><\/p>\n\n\n\n<p>Being a female project manager in this industry is still uncommon. I happen to be one of few females on the team – surrounded by about 90 percent male counterparts. Early on, I felt the need to earn their respect by working hard to sustain a leadership role in the construction industry. Over time, my team has become like family to me. They are always watching out and supporting me and each other.<\/p>\n\n\n\n<p>The last thing I want to mention is my signature phrase: “Teamwork makes the dream work!”<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p><strong><span class=\"has-inline-color has-myrgroup-blue-color\">Clean energy is the way of the future. It is an important factor for our environmental and economic health. The projects we&#8217;re working on are large scale and create a lot of job opportunities for the nearby communities. <\/span><\/strong><\/p><cite><strong><span class=\"has-inline-color has-myrgroup-blue-color\">AMY ARNOLD, PROJECT MANAGER, CSI ELECTRICAL CONTRACTORS<\/span><\/strong><\/cite><\/blockquote><\/figure>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"769\" height=\"1024\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2021\/10\/A-Day-In-The-Life-Project-Manager-Amy-Arnold-2.jpg\" alt=\"\" class=\"wp-image-1200\"\/><\/figure><\/div>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"705\" height=\"940\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2021\/10\/A-Day-In-The-Life-Project-Manager-Amy-Arnold-4.jpg\" alt=\"\" class=\"wp-image-1201\"\/><\/figure><\/div>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2021\/10\/A-Day-In-The-Life-Project-Manager-Amy-Arnold-1.jpg\" alt=\"\" class=\"wp-image-1202\" width=\"1316\" height=\"522\" srcset=\"https:\/\/exiinc.com\/wp-content\/uploads\/2021\/10\/A-Day-In-The-Life-Project-Manager-Amy-Arnold-1.jpg 989w, https:\/\/exiinc.com\/wp-content\/uploads\/2021\/10\/A-Day-In-The-Life-Project-Manager-Amy-Arnold-1-768x305.jpg 768w\" sizes=\"(max-width: 1316px) 100vw, 1316px\" \/><\/figure><\/div>\n","protected":false},"excerpt":{"rendered":"<p>PERSERVERANCE, TEAMWORK, AND KEEPING COOL UNDER PRESSURE ARE KEY ATTRIBUTES TO LEARNING, LEADING EFFECTIVELY, AND EARNING YOUR CREW’S TRUST Buried in the gusty Tehachapi mountains of California, lies one of the largest wind farms in the world. Among approximately 5,600 wind turbines is Amy Arnold, project manager of renewable projects for CSI Electrical Contractors, Inc. [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":1851,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[120,90,89],"class_list":["post-1199","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-a-day-in-the-life","category-all-news-stories","category-media","subsidiary-csi-electrical"],"acf":[],"_links":{"self":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/1199"}],"collection":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/comments?post=1199"}],"version-history":[{"count":10,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/1199\/revisions"}],"predecessor-version":[{"id":3050,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/1199\/revisions\/3050"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media\/1851"}],"wp:attachment":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media?parent=1199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/categories?post=1199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}