{"id":5152,"date":"2022-07-27T10:46:21","date_gmt":"2022-07-27T16:46:21","guid":{"rendered":"https:\/\/exiinc.com\/?p=5152"},"modified":"2024-10-11T16:05:03","modified_gmt":"2024-10-11T22:05:03","slug":"sturgeon-electrics-sustained-osha-vpp-star-status-a-testament-to-leadership-commitment","status":"publish","type":"post","link":"https:\/\/exiinc.com\/news\/sturgeon-electrics-sustained-osha-vpp-star-status-a-testament-to-leadership-commitment\/","title":{"rendered":"Sturgeon Electric’s sustained OSHA VPP STAR status a testament to leadership commitment"},"content":{"rendered":"\n<p class=\"has-drop-cap\">Scott Greenhalge stared at the screen long and hard.<\/p>\n\n\n\n<p>The letters were all too familiar, as was the face – defined by a kind smile framed by a  mustache – peering back at him. Despite knowing this face and that name better than anyone in the world, Sturgeon Electric’s senior vice president of Colorado commercial and industrial couldn’t process what he was seeing at first.<\/p>\n\n\n\n<p>“They had everything on the big screen and then my name came up on the screen,” Greenhalge remembers weeks later from his office with the same friendly smile and mustache. “And I thought, ‘This has to be a mistake.’”<\/p>\n\n\n\n<p>But it wasn’t a mistake. Or an accident. Just the culmination of years committed to safety and doing whatever was necessary to maintain one of Sturgeon Electric’s most proud accomplishments – maintaining STAR status in OSHA’s <a href=\"https:\/\/www.osha.gov\/vpp\/all-about-vpp\">Voluntary Protection Programs<\/a>, better known as VPP.<\/p>\n\n\n\n<p>And thanks to his dedication, going above and beyond to keep Sturgeon Electric the standard for safety in the region, VPP named Greenhalge as its Region VIII 2021 Leader of the Year at the regional conference in Cheyenne, Wyo. in May.<\/p>\n\n\n\n<p>Sturgeon Electric also received two Decades of Excellence awards at the event, one for its transmission and distribution division and another for its commercial and industrial division, overseen by Greenhalge.<\/p>\n\n\n\n<p>Keeping his nomination under wraps was a shared effort across the Sturgeon Electric safety team and the payoff was worth it.<\/p>\n\n\n\n<p>“A few of us heard rumors about it,” safety engineer Dan Hart said. “But the best part was seeing the look on his face when they announced his name. That was fantastic.”<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"1000\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-1-1600x1000.jpg\" alt=\"\" class=\"wp-image-5153\" srcset=\"https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-1-1600x1000.jpg 1600w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-1-1024x640.jpg 1024w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-1-768x480.jpg 768w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-1-1536x960.jpg 1536w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-1-2048x1280.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure>\n\n\n\n<p>Greenhalge reaches back and snags the Leader of the Year plaque from its perch just behind his desk. The award itself is simple but elegant with transparent glass set in wood, his name etched into its face. But it’s the name below his that means more to Greenhalge. Sturgeon Electric.<\/p>\n\n\n\n<p>Because to understand and appreciate Greenhalge’s recognition is to understand and appreciate all it took for the company to remain in good standing with VPP over a decade, a notoriously picky and demanding organization.<\/p>\n\n\n\n<p>“When I think of all (former regional safety manager) Chuck Soderquist put in, I don’t hold a candle to that,” Greenhalge said. “It was absolutely a shock. But it was also a team award, a group effort. It was no one person for sure. I told them that day, ‘this award is for all of us.’”<\/p>\n\n\n\n<p><a href=\"https:\/\/vimeo.com\/704536884\/65ea7b4d03\">Sturgeon Electric’s VPP story<\/a> began in 2008, achieving STAR status, which is VPP’s highest grade reserved for companies that demonstrate “exemplary achievement” in health and safety. But if achieving STAR status is challenging, maintaining it is downright rigorous.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p> “Winning the Decades of Excellence awards is absolutely a big deal. Receiving those Decades of Excellence awards, you rarely see that in VPP because it is so hard to stay in STAR status with OSHA. When you get those awards, you look around the group and see how proud they are of what they maintained.” <\/p><cite>Scott Greenhalge, SR. Vice President, Colorado Commercial &amp; Industrial, Sturgeon Electric<\/cite><\/blockquote><\/figure>\n\n\n\n<p>Surgical onsite evaluations, three-year audits, and an ongoing renewal process demand that every VPP STAR company remain at the tip of the spear or get dropped. This makes leadership commitment to safety and the program essential.<\/p>\n\n\n\n<p>Time, money, and other resources must be dedicated to continue meeting VPP’s ever-changing criteria. For example, Sturgeon Electric now has dedicated safety personnel to address industrial hygiene and adopted PPE that allows them to detect silica in the air and closely monitor decibel levels on job sites.<\/p>\n\n\n\n<p>“The most important thing for maintaining VPP status is the manager buy-in, and I don’t think there’s a person in Sturgeon Electric management that doesn’t participate, from (MYR Group president and CEO) Rick (Swartz) down,” Hart said. “It’s amazing to have that support.”<\/p>\n\n\n\n<p>Hart (himself having been voted onto the Region VIII board of directors, taking over for regional safety manager Zachary Valdez) has seen firsthand just how far safety has come in his 20 years working for Sturgeon Electric, from rarely seeing hard hats and safety glasses used back in the day to now seeing employees required to wear silica-detecting alarms on their vests.<\/p>\n\n\n\n<p>And make no mistake, Sturgeon Electric’s involvement with VPP over the better part of two decades is a large reason why. Which is what makes winning not one, but two Decades of Excellence awards for both workforce divisions so special, if not practically unheard of for a mobile workforce spread across the country.<\/p>\n\n\n\n<p>“Winning the Decades of Excellence awards is absolutely a big deal,” Greenhalge said. “Receiving those Decades of Excellence awards, you rarely see that in VPP because it is so hard to stay in STAR status with OSHA. When you get those awards, you look around the group and see how proud they are of what they maintained.”<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"870\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-3-1600x870.jpg\" alt=\"\" class=\"wp-image-5155\" srcset=\"https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-3-1600x870.jpg 1600w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-3-1024x557.jpg 1024w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-3-768x418.jpg 768w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-3-1536x835.jpg 1536w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/VPP-3-2048x1113.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure>\n\n\n\n<p>The group. You can’t talk about Sturgeon Electric’s VPP STAR status with Greenhalge without the group coming up. The company sent 17 people to the Cheyenne event, another subtle clue to just how dedicated leadership is to the program.<\/p>\n\n\n\n<p>For a few days, it wasn’t about “working” or making money, but about enjoying the well-deserved recognition born from countless hours going just that one step further.<\/p>\n\n\n\n<p>Because after all these years – and all the bumps, bruises, and achievements along the way – there is no going back.<\/p>\n\n\n\n<p>“Our people count on us to be the best, and if we were to get suspended from VPP, that would be devastating to all those people who’ve strived so hard to remain in it,” Greenhalge said. “For both T&amp;D and C&amp;I to maintain STAR status for this many years is huge. “Our employees work hard for that status, and they want to make sure we don’t lose it.”<\/p>\n\n\n\n\n\n\n\n<p><strong>Working safely and pursuing continuous improvement of safety is a team effort.<\/strong> <\/p>\n\n\n\n<div class=\"wp-block-buttons is-content-justification-center is-layout-flex wp-container-core-buttons-is-layout-1 wp-block-buttons-is-layout-flex\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/exiinc.com\/safety\/\">See how our teams approach safety<\/a><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Scott Greenhalge stared at the screen long and hard. The letters were all too familiar, as was the face – defined by a kind smile framed by a mustache – peering back at him. Despite knowing this face and that name better than anyone in the world, Sturgeon Electric’s senior vice president of Colorado commercial [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":5154,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[94,95],"class_list":["post-5152","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-industry-recognition","category-safety","subsidiary-sturgeon-electric"],"acf":[],"_links":{"self":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/5152"}],"collection":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/comments?post=5152"}],"version-history":[{"count":8,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/5152\/revisions"}],"predecessor-version":[{"id":9396,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/5152\/revisions\/9396"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media\/5154"}],"wp:attachment":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media?parent=5152"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/categories?post=5152"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}