{"id":5162,"date":"2022-07-27T11:03:38","date_gmt":"2022-07-27T17:03:38","guid":{"rendered":"https:\/\/exiinc.com\/?p=5162"},"modified":"2024-08-20T09:44:47","modified_gmt":"2024-08-20T15:44:47","slug":"a-day-in-the-life-project-manager-dave-manson","status":"publish","type":"post","link":"https:\/\/exiinc.com\/news\/a-day-in-the-life-project-manager-dave-manson\/","title":{"rendered":"A Day In the Life: Project Manager, Dave Manson"},"content":{"rendered":"\n<p class=\"has-drop-cap\">We sat down with Dave Manson, a project manager for Western Pacific Enterprises (WPE) in charge of the <a href=\"https:\/\/exiinc.com\/projects\/trans-mountain-pipeline-piic\/\">Trans Mountain Pipeline<\/a>, a nearly 1,000-mile span of pipeline from Alberta to the coast of British Columbia. WPE handles the upgrades and new construction for 14 substations that power the pipeline’s pumps, which move oil across Western Canada.<\/p>\n\n\n\n<p>Manson provides insight into what a project manager’s key responsibilities are and the essential tools that help him – and the company – achieve success on a <a>years-<\/a>long project. A wide range of hurdles from multiple stakeholder interests and materials shipped from overseas to, yes, even birds nesting their young, keep Manson and his team on their toes each day.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What is a Project Manager at WPE and why is it important?<\/strong><\/h2>\n\n\n\n<p>A: The primary focus of a project manager is to take on the company’s interests in relation to the execution of a project. So, meeting the client’s expectations and meeting the contract requirement; nothing more, nothing less. It’s a client relation exercise in making sure that you not only deliver the project they’re expecting but have the intent to create a long-lasting relationship that surpasses the current project that you’re in.<\/p>\n\n\n\n<p>If you were to ask what my job is point blank, it’s communication. Communicating with everybody, all the stakeholders, operating from that 30,000-foot level and seeing all the players on the board, and talking with the right people at the right time.<\/p>\n\n\n\n<p>But it’s fun! When you see a project start coming together, it’s a thing of beauty. It’s great work and very rewarding.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What are your daily tasks and responsibilities?<\/strong><\/h2>\n\n\n\n<p>A: Making sure we have <a>the people<\/a> on site, with the proper safety and quality mindset so we’re not doing things twice. I ensure we work toward meeting the client’s schedule tracking labor and staying on budget. But there is also the opportunity to be a problem solver.<\/p>\n\n\n\n<p>We oversee contract deliverables such as quality, schedule, the contract budget, and ensuring projects are completed safely and professionally.<\/p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>We have a great support system here from my immediate supervisor to two and three levels up from there. It’s almost like we don’t really have job titles, we’re all here as a team. And that’s a corporate culture. We have it here at WPE and I’ve seen that throughout MYR Group as well. There’s a culture of comradery. We realize if we’re all doing it together, everybody benefits. It’s a good feeling to be supported. <\/p><\/blockquote><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What does a typical day look like for you?<\/strong><\/h2>\n\n\n\n<p>A: A typical day starts out with a morning huddle, and we go through the plan for the day, what their challenges are, and talk about things like material procurement, engagement of the subcontractors, and engagement of the client. It’s a daily discussion of things that are in the future and putting those plans in place before they can become emergencies, and instead, they’re just planned activities.<\/p>\n\n\n\n<p>The rest of my day is spent with accounting and invoices, making schedule updates, following up with our quality person to see that deliverables are on schedule, and working with our joint venture partners on safety and quality, which are the two largest drivers of the project; they go hand in hand. You’re always looking at the schedule or the situation and adjusting as the life of the project goes on.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What do you love the most about your role?<\/strong><\/h2>\n\n\n\n<p>A: The teamwork! There are two parts to that: the team I’m in charge of, but then there are all the other stakeholders involved that are supporting you, understanding you, and working with you. Contracts by nature can have some friction because of the money involved and egos and such, but if you can get every stakeholder on board and see that you are there to be the solution, it’s great. It’s not about the money, it’s about having a plan for their <a>ask<\/a> and providing that solution; finding ways to bring things together. That’s the win and it’s fulfilling – they give you that trust to do what you need to do to get it done.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What do you like about being a project manager for WPE and MYR Group?<\/strong><\/h2>\n\n\n\n<p>A: We have a great support system here from my immediate supervisor to two and three levels up from there. It’s almost like we don’t really have job titles, we’re all here as a team. And that’s a corporate culture. We have it here at WPE and I’ve seen that throughout MYR Group as well. There’s a culture of comradery. We realize if we’re all doing it together, everybody benefits. It’s a good feeling to be supported.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What skills or traits do you think are important for a person in your role?<\/strong><\/h2>\n\n\n\n<p>A: Organization and planning. If you’re organized and you have good plans in place, that communication to everybody is confident, concise, and everybody stays informed. Keeping everybody informed reduces stress and reduces reactive circumstances. Organization and planning are really, <a>really big<\/a> for any project.<\/p>\n\n\n\n<figure class=\"wp-block-image alignwide size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1649\" height=\"1032\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/Dave-Manson-2-edited.jpg\" alt=\"\" class=\"wp-image-5169\" srcset=\"https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/Dave-Manson-2-edited.jpg 1649w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/Dave-Manson-2-edited-1024x641.jpg 1024w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/Dave-Manson-2-edited-1600x1001.jpg 1600w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/Dave-Manson-2-edited-768x481.jpg 768w, https:\/\/exiinc.com\/wp-content\/uploads\/2022\/07\/Dave-Manson-2-edited-1536x961.jpg 1536w\" sizes=\"(max-width: 1649px) 100vw, 1649px\" \/><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: How did you end up in this role? What was your career path?<\/strong><\/h2>\n\n\n\n<p>A: I started as an electrical apprentice and worked my way up to a journeyman, then a foreman, then became a general foreman, and then a superintendent, just working my way up. I got involved with estimating because I wanted a new challenge and was interested in project management and budgeting. Ultimately, I became the chief estimator and that allowed me to see things from a high level and how to switch between low level and level thinking. I wanted to get into project management and came to WPE as a project manager, and it’s been great!<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Q: What advice would you give to someone interested in pursuing a career in your position?<\/strong><\/h2>\n\n\n\n<p>A: My No. 1 piece of advice would be to pay attention to all things around you if you’re coming up through the field. Ask questions of your supervisors. Most people are willing to talk. Ask ‘why is this happening?’ or ‘why do we go about it this way?’ Talk to a project manager, be inquisitive, and understand the bigger picture to understand why you’re doing what you’re doing. There are no dumb questions when learning something.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We sat down with Dave Manson, a project manager for Western Pacific Enterprises (WPE) in charge of the Trans Mountain Pipeline, a nearly 1,000-mile span of pipeline from Alberta to the coast of British Columbia. WPE handles the upgrades and new construction for 14 substations that power the pipeline’s pumps, which move oil across Western [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":5163,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[120,91,1],"class_list":["post-5162","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-a-day-in-the-life","category-our-company","category-general","subsidiary-western-pacific-enterprises"],"acf":[],"_links":{"self":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/5162"}],"collection":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/comments?post=5162"}],"version-history":[{"count":5,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/5162\/revisions"}],"predecessor-version":[{"id":5170,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/5162\/revisions\/5170"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media\/5163"}],"wp:attachment":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media?parent=5162"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/categories?post=5162"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}