{"id":9432,"date":"2024-10-17T13:12:16","date_gmt":"2024-10-17T19:12:16","guid":{"rendered":"https:\/\/exiinc.com\/?p=9432"},"modified":"2024-10-17T13:12:17","modified_gmt":"2024-10-17T19:12:17","slug":"neca-honors-harlan-electric-company-and-sturgeon-electric-company-for-project-excellence","status":"publish","type":"post","link":"https:\/\/exiinc.com\/news\/neca-honors-harlan-electric-company-and-sturgeon-electric-company-for-project-excellence\/","title":{"rendered":"NECA Honors Harlan Electric Company and Sturgeon Electric Company for Project Excellence"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\"><strong>MYR Group subsidiaries win 2024 Awards in Low Voltage\/Technology and Transportation &amp; Infrastructure<\/strong><\/h2>\n\n\n\n<p>Two MYR Group subsidiaries earned <a href=\"https:\/\/www.necanet.org\/news-media\/detail\/news\/2024\/08\/16\/winners-of-neca's-2024-project-excellence-awards-announced\">Project Excellence Awards<\/a> (PEA) this year for finding solutions on their unique and complex projects.<\/p>\n\n\n\n<p>The National Electric Contractors Association (NECA) awarded Harlan Electric Company (Harlan Electric) the 2024 PEA for low voltage and technology for its work on the IKE Smart City Kiosks project. Navigating underground unknowns and constructing in a busy, urban environment they constructed 30 separate navigation and public resource kiosks throughout downtown Detroit last year. This is Harlan Electric’s second PEA in two years.<\/p>\n\n\n\n<p>NECA also awarded Sturgeon Electric Company (Sturgeon Electric) a 2024 PEA for the Central 70 project, in the transportation and infrastructure category. The highway expansion project was the largest, single Colorado Department of Transportation project ever awarded and Sturgeon Electric’s second PEA-winning project in the past three years.<\/p>\n\n\n\n<p>Both project teams, all supporting teams, and field employees involved deserve praise for their hard work, creativity, and determination which resulted in not only successful projects for their customers, but this exceptional recognition from NECA.<\/p>\n\n\n\n<p>District Manager Adam Segers said, “I couldn’t be prouder of the Harlan team responsible for winning this project excellence award. The hard work and collaboration of everyone involved is what made the IKE Smart City kiosks project such a success. Thank you all!” <\/p>\n\n\n\n<p>“Central 70 was a monumental project that required the entire team to assess how we perform our work and improve performance, including procurement, scheduling, methodology, quality, performance, reliability – and of course – safety,” Sturgeon Electric Vice President, Colorado Transportation Jim Bushnell said. “Everyone who worked on Central 70 should be proud of this accomplishment because we couldn’t have done it without you.” <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Harlan Electric Conquers Underground Unknowns to Deliver Detroit Kiosks<\/strong><\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"1201\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/HAR_IKE-Smart-City-Kiosk-1600x1201.jpg\" alt=\"Interactive touch screen kiosk in city\" class=\"wp-image-9366\" srcset=\"https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/HAR_IKE-Smart-City-Kiosk-1600x1201.jpg 1600w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/HAR_IKE-Smart-City-Kiosk-1024x769.jpg 1024w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/HAR_IKE-Smart-City-Kiosk-768x577.jpg 768w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/HAR_IKE-Smart-City-Kiosk-1536x1153.jpg 1536w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/HAR_IKE-Smart-City-Kiosk-2048x1538.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure>\n\n\n\n<p>Detroit is undergoing a transformation and Harlan Electric is there to support it. In 2023, they constructed 30 separate IKE Smart City kiosks throughout downtown Detroit. These interactive kiosks provide free wi-fi, map search functions, public resources and display local art to residents and visitors across the city.<\/p>\n\n\n\n<p>“They [IKE Smart City] said, ‘Here’s a novel project, make it work’” said Harlan Electric Project Manager Max Dade, “And we did.”<\/p>\n\n\n\n<p>The team faced the challenges of underground power construction in a city with old infrastructure, with work sites in some of its busiest areas, and they excelled. To work efficiently, they proofed each site ahead of time to find the nearest available power source or come up with a plan to install a connection where those were needed. In one instance, Harlan Electric found a section of collapsed conduit and repaired a 200-foot section.<\/p>\n\n\n\n<p>They also worked with the customer to redesign the kiosk foundations when the working area was too constrained for the original foundation design. Not only did Harlan Electric succeed in delivering the projects for its customer and the community, they did it safely without any recordable incidents, and without any underground infrastructure damage.<\/p>\n\n\n\n<p class=\"has-text-align-center\"><em><a href=\"https:\/\/www.harlanelectric.com\/news\/harlan-electric-garners-2024-neca-project-excellence-award-for-bringing-wi-fi-and-resource-kiosks-to-detroit\/\"><strong>Read more about the IKE Smart City kiosks project<\/strong><\/a><\/em><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Three Divisions of Sturgeon Electric Partner to Deliver Successful Central 70 Project<\/strong><\/h3>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1600\" height=\"997\" src=\"https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/Central-70-Project-23-1600x997.jpg\" alt=\"\" class=\"wp-image-9430\" srcset=\"https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/Central-70-Project-23-1600x997.jpg 1600w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/Central-70-Project-23-1024x638.jpg 1024w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/Central-70-Project-23-768x479.jpg 768w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/Central-70-Project-23-1536x957.jpg 1536w, https:\/\/exiinc.com\/wp-content\/uploads\/2024\/10\/Central-70-Project-23-2048x1276.jpg 2048w\" sizes=\"(max-width: 1600px) 100vw, 1600px\" \/><\/figure>\n\n\n\n<p>Sturgeon Electric worked in close collaboration with Kiewit Meridiam Partners and Colorado Department of Transportation (CDOT) to successfully complete the highly visible <a href=\"https:\/\/exiinc.com\/projects\/central-70-project\/\">Central 70 (C70) project.<\/a> From the estimate\/design concept in 2015 to the final completion in July 2023, the project was a massive undertaking for Colorado, easily its most ambitious transportation initiative. <\/p>\n\n\n\n<p>In total, 13 miles of roadway was widened, and an additional one or two express lanes (in certain areas) were added in each direction. The project removed the original 57-year-old viaduct that supported the existing highway (over three railroads, hence the highway over or under) between Brighton and Colorado Boulevards, instead lowering the interstate below grade. This allowed for the rejoining of two communities, divided for six decades, by a four-acre public park and cross streets.&nbsp;<\/p>\n\n\n\n<p>Sturgeon Electric completed the electrical scope of work for the project which included temporary and permanent traffic signals, roadway lighting, Intelligent Transportation Systems (ITS), and electrical for the park, making it the largest single project CDOT had ever awarded.&nbsp;It was also one of the rare projects that involved all three of the company’s groups working together (transmission and distribution, inside electrical, and transportation). In the end, Sturgeon Electric played a pivotal role in greatly improving the safety, connectivity, and efficiency of one of Denver’s economic backbones. The completion of this years-long project was a monumental success for the city and state, and we were honored to help bring this aging stretch of highway into the 21st century and positively influence communities in the process.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\"><em><a href=\"https:\/\/sturgeonelectric.com\/news\/sturgeon-electric-wins-2024-neca-project-excellence-award-for-central-70-highway-expansion-in-denver\/\"><strong>Read more about the Central-70 project<\/strong><\/a><\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>MYR Group subsidiaries win 2024 Awards in Low Voltage\/Technology and Transportation &amp; Infrastructure Two MYR Group subsidiaries earned Project Excellence Awards (PEA) this year for finding solutions on their unique and complex projects. The National Electric Contractors Association (NECA) awarded Harlan Electric Company (Harlan Electric) the 2024 PEA for low voltage and technology for its [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":9365,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[90,94,92],"class_list":["post-9432","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-all-news-stories","category-industry-recognition","category-projects"],"acf":[],"_links":{"self":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/9432"}],"collection":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/comments?post=9432"}],"version-history":[{"count":2,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/9432\/revisions"}],"predecessor-version":[{"id":9435,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/posts\/9432\/revisions\/9435"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media\/9365"}],"wp:attachment":[{"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/media?parent=9432"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/exiinc.com\/wp-json\/wp\/v2\/categories?post=9432"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}